[
  {"id":102605687,"created":"2022-12-01 03:47:40","last_updated":"2022-12-12 07:51:13","time_posted":"2 days ago","title":"Operational Risk Director - Enterprise Functions","description":"About This Role\n\nWells Fargo is seeking an Operational Risk Director to oversee Wells Fargo Technology Enterprise Functions (i.e., Finance, Chief Operating Office, Human Resources, Public Affairs, Corporate Risk, and Legal) on risk generated activities. This risk oversight leadership is expected to collaborate closely with the respective Operational Risk Business Oversight leaders for applications as well as collaborate with Technology Infrastructure and Chief Technology Office Oversight leaders on the infrastructure supporting Enterprise Functions' applications.\n\nIn This Role, You Will\nProvide vision and set direction for Operational Risk teams to achieve long-term strategic objectives that impact organization and management across functions\nManage the development, implementation, and monitoring of a risk-based program for a business or large functional area with moderate to high risk to identify, assess, and mitigate operational risk that arises from inadequate or failed internal processes, people, systems, or external events\nMaintain a balance between risk mitigation and operational efficiency\nDirect execution of major operational risk programs companywide or lines of businesses with significant risk and multiple, complex regulatory environments\nProvide subject matter expertise across lines of business or directly manage enterprise controls for specific functional areas\nInfluence and provide input on policy, framework, and program development for related lines of business or companywide strategy\nEnsure reporting, escalation, and remediation of issues, deficiencies or regulatory matters regarding operational risk to leaders, committees, and appropriate executive management\nIdentify programs or initiatives related to line of business and enterprise strategy with considerable impact companywide and externally\nCollaborate and influence all levels of professionals including more experienced leaders\nLead team to achieve objectives\nManage communication and collaboration with business heads, Legal, Audit, and regulators on risk related topics\nManage allocation of people and financial resources for Operational Risk\nDevelop and guide a culture of talent development to meet business objectives and strategy\n   Required Qualifications, US:  \n8+ years of Operational Risk experience or equivalent experience demonstrated through one or a combination of the following: work experience, training, military experience, education\n4+ years of Management experience\n   Desired Qualifications:  \nExtensive risk management or audit experiences in a senior management role\nStrong executive presence with the ability to inspire a large and geographically dispersed organization.\nProven ability to establish a strategic vision and drive strong outcomes and results.\nDemonstrated ability to influence and lead across first and second line of defenses while maintaining close relationships with third line of defenses.\nHighly experienced in building and maintaining relationships with the regulators and ability to understand regulatory trends and expectations.\nExcellent analytical and problem-solving skills, inquisitive nature and comfort challenging current practices to drive efficiency and standardization.\nKnowledge of technology and security organization practices, operations, risk management processes, principles, architectural requirements, including incident response methodologies. Additionally, practitioner experiences are desirable.\n   Job Expectations:  \nManaging a team of experienced Technology and Information Security risk professional in a global organization responsible for oversight on Chief Information Officers supporting Wells Fargo enterprise Functions.\nDelivering and synthesizing technology and information security risks results by applying business risks acumen for the enterprise functions.\nBuild and maintain relationships with senior business and technology stakeholders by providing our independent risk assessments and ability to influence, advice, and counsel these stakeholders to focus on most prioritized risks presented in the businesses.\nAbility to negotiate challenges to achieve best outcomes.\nWorking across the aisles and demonstrate leadership within Corporate Risk and Operational Risk Management globally to drive (and initiate if needed) collaboration and consistency on oversight activities and risk assessments.\nExperienced in a strong escalation culture to drive consistent execution of a robust control environment and awareness within the senior management of the businesses.\nProvide thought leadership by leading and guide teams through the complex changing environment in the organization.\nKeeping abreast of industry trends and emerging risks and anticipate areas of focus and attention of regulators, keeping the business and corporate risk colleagues informed\n  We Value Diversity \n\nAt Wells Fargo, we believe in diversity, equity and inclusion in the workplace; accordingly, we welcome applications for employment from all qualified candidates, regardless of race, color, gender, national origin, religion, age, sexual orientation, gender identity, gender expression, genetic information, individuals with disabilities, pregnancy, marital status, status as a protected veteran or any other status protected by applicable law.\n\nEmployees support our focus on building strong customer relationships balanced with a strong risk mitigating and compliance-driven culture which firmly establishes those disciplines as critical to the success of our customers and company. They are accountable for execution of all applicable risk programs (Credit, Market, Financial Crimes, Operational, Regulatory Compliance), which includes effectively following and adhering to applicable Wells Fargo policies and procedures, appropriately fulfilling risk and compliance obligations, timely and effective escalation and remediation of issues, and making sound risk decisions. There is emphasis on proactive monitoring, governance, risk identification and escalation, as well as making sound risk decisions commensurate with the business unit's risk appetite and all risk and compliance program requirements.\n\nCandidates applying to job openings posted in US: All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.\n\nCandidates applying to job openings posted in Canada: Applications for employment are encouraged from all qualified candidates, including women, persons with disabilities, aboriginal peoples and visible minorities. Accommodation for applicants with disabilities is available upon request in connection with the recruitment process.\n\nReference Number\n\nR-221205-1","seniority":"Director","employment_type":"Full-time","location":"Charlotte, NC","url":"https://www.linkedin.com/jobs/view/operational-risk-director-enterprise-functions-at-wells-fargo-3382262872","hash":"2865db30f165b518bbc95d6e1a3a3707","company_id":5763468,"company_name":"Wells Fargo","company_url":"https://www.linkedin.com/company/wellsfargo","external_url":null,"deleted":1,"application_active":1,"salary":null,"applicants_count":"Be among the first 25 applicants","linkedin_job_id":3382262872,"country":"United States","last_updated_ux":1670831473,"redirected_url":"https://www.linkedin.com/jobs/view/operational-risk-director-enterprise-functions-at-wells-fargo-3382262872","redirected_url_hash":"2865db30f165b518bbc95d6e1a3a3707","job_functions_collection":[{"id":57978604,"job_id":102605687,"function_id":12179,"deleted":0,"created":"2022-12-01 03:47:40","last_updated":"2022-12-01 03:47:40","job_function_list":{"id":12179,"created":"2022-07-05 06:45:23","last_updated":"2022-07-05 06:45:23","function":"Management and Manufacturing","hash":"6f7f02ed0217baa605d9f42160c790e2"}}],"job_industries_collection":[{"id":77247616,"job_id":102605687,"industry_id":423,"deleted":0,"created":"2022-12-01 03:47:40","last_updated":"2022-12-01 03:47:40","job_industry_list":{"id":423,"created":"2022-06-22 07:28:32","last_updated":"2022-06-22 07:28:32","industry":"Banking, Financial Services, and Investment Management","hash":"66b974ea092116e00265a7948e422748"}}],"job_status_log_collection":[{"id":1431522932,"job_id":102605687,"created":"2022-12-01 03:47:40","last_updated":"2022-12-01 03:49:16","status":"active","deleted":1},{"id":1431529941,"job_id":102605687,"created":"2022-12-01 03:49:16","last_updated":"2022-12-01 03:57:58","status":"active","deleted":1},{"id":1431563346,"job_id":102605687,"created":"2022-12-01 03:57:57","last_updated":"2022-12-01 04:04:48","status":"active","deleted":1},{"id":1431587548,"job_id":102605687,"created":"2022-12-01 04:04:47","last_updated":"2022-12-01 04:20:24","status":"active","deleted":1},{"id":1431637730,"job_id":102605687,"created":"2022-12-01 04:20:24","last_updated":"2022-12-01 04:53:55","status":"active","deleted":1},{"id":1431703339,"job_id":102605687,"created":"2022-12-01 04:53:54","last_updated":"2022-12-01 04:59:33","status":"active","deleted":1},{"id":1431714066,"job_id":102605687,"created":"2022-12-01 04:59:32","last_updated":"2022-12-03 04:59:52","status":"active","deleted":1},{"id":1442214959,"job_id":102605687,"created":"2022-12-03 04:59:52","last_updated":"2022-12-12 07:51:13","status":"active","deleted":1},{"id":1475356906,"job_id":102605687,"created":"2022-12-12 07:51:12","last_updated":"2022-12-12 07:51:13","status":"deleted","deleted":0}]},
  {"id":102729111,"created":"2022-12-01 13:02:11","last_updated":"2022-12-16 04:26:38","time_posted":"1 day ago","title":"Head of Buyer Experience COE","description":"Responsible for strategy, design, and implementation of a new approach to the Wipro client experience. Through a combined focus on developing a centers of expertise (COE) that would create a deeper level of access to Wipro expertise and the creation of supporting materials, the role will seek to build a stronger level of alliance and coordination between sales and marketing via a design-centric, strategic approach. \n\n\n\n\n\nInitially focused on high-value client pursuits the role will look to broaden, expand and productize learnings while establishing new engagement methods across the range of opportunities and industries. The role will be strategic to the current Wipro transformation from creation of story narratives to empowering our client-facing Wipro employees abilities to interpret and engage with clients on a deeper, more strategic level and in the market. \n\n\n\n\n\n\n\n\n\n\n\nBuild a Buyer Experience COE to create a series of quality, consistent communications at every touchpoint that align to our brand message.\n\n\nSales Assets and Content Management\nTheme Development, Story Telling, Design Thinking\nBuyer Experience Design across all Touchpoints\nProposal Production (and the framework governance)\n\n\n\n\n\n\n\n\n\nRequirements\n\n\nBuyer Experience CoE head, Band D2\nSales Content Management lead + existing catalyst team\nStory Telling / Design Thinking Professionals\nProposal Production Resources, possibly internal","seniority":"Director","employment_type":"Full-time","location":"Philadelphia, PA","url":"https://www.linkedin.com/jobs/view/head-of-buyer-experience-coe-at-wipro-3375381847","hash":"ec4ee071bf0a3b7b466103a613333f47","company_id":5806914,"company_name":"Wipro","company_url":"https://www.linkedin.com/company/wipro","external_url":null,"deleted":1,"application_active":1,"salary":null,"applicants_count":"Be among the first 25 applicants","linkedin_job_id":3375381847,"country":"United States","last_updated_ux":1671164798,"redirected_url":"https://www.linkedin.com/jobs/view/head-of-buyer-experience-coe-at-wipro-3375381847","redirected_url_hash":"ec4ee071bf0a3b7b466103a613333f47","job_functions_collection":[{"id":58090575,"job_id":102729111,"function_id":12211,"deleted":0,"created":"2022-12-01 13:02:11","last_updated":"2022-12-01 13:02:11","job_function_list":{"id":12211,"created":"2022-07-05 06:45:57","last_updated":"2022-07-05 06:45:57","function":"Purchasing and Supply Chain","hash":"745722edaad27b4d77e76ed39873cea1"}}],"job_industries_collection":[{"id":77396328,"job_id":102729111,"industry_id":421,"deleted":0,"created":"2022-12-01 13:02:11","last_updated":"2022-12-01 13:02:11","job_industry_list":{"id":421,"created":"2022-06-22 07:28:22","last_updated":"2022-06-22 07:28:22","industry":"IT Services and IT Consulting","hash":"a21b8330e90140228cb4a654461ef546"}}],"job_status_log_collection":[{"id":1433351636,"job_id":102729111,"created":"2022-12-01 13:02:11","last_updated":"2022-12-01 13:18:29","status":"active","deleted":1},{"id":1433427852,"job_id":102729111,"created":"2022-12-01 13:18:28","last_updated":"2022-12-03 07:34:45","status":"active","deleted":1},{"id":1442606584,"job_id":102729111,"created":"2022-12-03 07:34:45","last_updated":"2022-12-16 04:26:38","status":"active","deleted":1},{"id":1492369099,"job_id":102729111,"created":"2022-12-16 04:26:37","last_updated":"2022-12-16 04:26:38","status":"deleted","deleted":0}]},
  {"id":102820410,"created":"2022-12-01 18:32:43","last_updated":"2022-12-03 14:00:59","time_posted":"1 day ago","title":"Director, Large Customer Sales, Central and Eastern Europe","description":"Note: By applying to this position you will have an opportunity to share your preferred working location from the following: Warsaw, Poland; Budapest, Hungary; Bucharest, Romania.\n\nMinimum qualifications:\nBachelor's degree in Marketing, Business Management, or equivalent practical experience.\nExperience in C-level customer sales.\nExperience in sales mentoring, leading, and developing an executive-led team.\nAbility to speak and write in English fluently.\n\n\nPreferred qualifications:\nExperience in an advertising sales or business development role.\nExperience working across multiple markets in large organizations.\nExperience leading decentralized teams, mentoring, and developing talent.\nAdvertising experience from the advertiser, agency, or other media owner side.\nKnowledge of Google’s advertising products and their applications.\nAbility to use stakeholder management and prioritization skills.\n\n\nAbout The Job\n\nAs Central and Eastern European (CEE) Client Solutions Director, you will manage the team for high performance, help lead transformational project proposals and solutions with customers while mentoring for career development. You will join C-level meetings as an expert to describe the value of products and solutions. You will also be the representative to EMEA and Global product teams to help develop these business areas in CEE. You will also partner closely with the regional management to help shape and jointly execute on the product business strategy.\n\nOur Large Customer Sales teams partner closely with many of the world’s biggest advertisers and agencies to develop digital solutions that build businesses and brands. We enjoy a bird’s eye view on the massive transformation occurring as advertising shifts to mobile and online platforms. We're uniquely situated to help shape how companies grow their businesses in the digital age. We advise clients on Google's broad range of products across search, video and mobile to help them connect instantly and seamlessly with their audiences.\n\nResponsibilities\n\nWork with executive leaders and managers across the region and functions on defining and prioritizing the local product-levers and needs, while translating global priorities into regional strategy.\nPartner with external customers and agencies on strategic and complex solutions and technologies. Mentor Product Specialists in day-to-day work, help remove structural bottlenecks, and manage their performance.\nRepresent CEE in the EMEA/Global product councils, connecting and sharing best practices with other Product Specialist leads.\nWork with Product Specialist to ensure they have a meaningful development plan for their career and capabilities.\n\n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .","seniority":"Director","employment_type":"Full-time","location":"Warsaw, Mazowieckie, Poland","url":"https://www.linkedin.com/jobs/view/director-large-customer-sales-central-and-eastern-europe-at-google-3379565208","hash":"d4d8d86697ef5fd121491bc3dfb55144","company_id":3252082,"company_name":"Google","company_url":"https://www.linkedin.com/company/google","external_url":null,"deleted":0,"application_active":1,"salary":null,"applicants_count":"88 applicants","linkedin_job_id":3379565208,"country":"Poland","last_updated_ux":1670076059,"redirected_url":"https://www.linkedin.com/jobs/view/director-large-customer-sales-central-and-eastern-europe-at-google-3379565208","redirected_url_hash":"d4d8d86697ef5fd121491bc3dfb55144","job_functions_collection":[{"id":58170438,"job_id":102820410,"function_id":15537,"deleted":0,"created":"2022-12-01 18:32:43","last_updated":"2022-12-01 18:32:43","job_function_list":{"id":15537,"created":"2022-07-05 09:34:15","last_updated":"2022-07-05 09:34:15","function":"General Business, Strategy/Planning, and Consulting","hash":"8ddc3421d52301c6cc552767a605759f"}}],"job_industries_collection":[{"id":77479458,"job_id":102820410,"industry_id":752,"deleted":0,"created":"2022-12-01 18:32:43","last_updated":"2022-12-01 18:32:43","job_industry_list":{"id":752,"created":"2022-07-05 09:31:46","last_updated":"2022-07-05 09:31:46","industry":"Information Services and Technology, Information and Internet","hash":"ccec78135ad925f08c170fd2a087eef6"}}],"job_status_log_collection":[{"id":1434846700,"job_id":102820410,"created":"2022-12-01 18:32:43","last_updated":"2022-12-01 19:31:49","status":"active","deleted":1},{"id":1435124212,"job_id":102820410,"created":"2022-12-01 19:31:48","last_updated":"2022-12-03 14:00:59","status":"active","deleted":1},{"id":1444252152,"job_id":102820410,"created":"2022-12-03 14:00:58","last_updated":"2022-12-03 14:00:59","status":"active","deleted":0}]},
  {"id":102839215,"created":"2022-12-01 19:11:51","last_updated":"2022-12-13 05:02:37","time_posted":"1 week ago","title":"VP, Head of Enterprise Architecture, Research, and Developer Experience","description":"About Ford\n\n Job Description \n\nCome help build a better world, where every person is free to move and pursue their dreams. Ford Motor Company was built on the belief that freedom of movement drives human progress. It’s a belief that has fueled our passion to create great cars and trucks. And today, it drives our commitment to become the world’s most trusted mobility company, designing vehicles for a smart world that helps people move more safely, confidently, and freely. Ford is experiencing significant business transformation in an ever-changing digital world. We are dedicated to delivering distinctive products and solutions, having an “always on” relationship with customers and continuously improving our user experience.\n\nSince 1959, Ford Credit has worked with dealerships to put people behind the wheels of great Ford and Lincoln vehicles. We provide financing, outstanding service and professional expertise to five thousand dealers and more than four million customers in at least 100 countries. Prospective employees can expect a professional atmosphere with opportunities to grow.\n\nWhat You’ll Be Able To Do\n\nAstheHead of Enterprise Architecture, Research, & Developer Experience, you will lead a team of 200+ experienced technical professionals (Architects, Developer Experience, Research Labs Scientist) to design Ford Credit enterprise architecture, transform Ford Credit software engineering practice, and research cutting edge technology. This opportunity will report to Saurabh Raisinghani, Chief Technology Officer.\n\nIn addition, you will:\n\nDefine global systems and application architecture for Model E, Ford Pro FinSimple and Ford Blue products\nLead the design of multi-year technology roadmap, outlining the core technology needed to execute Model E business model as well as run Ford Credit’s current business model\nModernize large global Ford Credit footprint into a cloud-first model using Google Cloud Platform, effectively enabling cloud-native business solutions.\nPartner and guide application, infrastructure, security, and Product teams to define, design, and deliver technical roadmaps and architecture patterns that enable the business while aligning with Ford Credit strategic objectives\nBuild a high functioning architecture that provide high level of partnership to the Engineering Digital Product and Platform teams\nProvide strategic thought leadership to Engineering and Business teams\nProvide constructive peer review feedback for product ideas submitted from other areas of the organization\nContinue to evolve the organization in support of the PDO model and use of Agile methods\nWork with lead Product Owner matched pair to coordinate quarterly prioritization process while delivering the quarterly OKRs\nWork with security, infrastructure, and SRE teams to implement DevOps and lead the automation of infrastructure deployments and ensure security and compliance\nPromote technical delivery of large-scale projects on all infrastructure technologies\nEnsure that technology delivery meets policy, regulatory, architectural and security standards\nVerify that the delivered software group products meet desired encryption, security, and business outcomes.\nProvide industry thought leadership for Policies, Processes, People and Tools, while driving a software development lifecycle.\n\n\nBasic Qualifications\n\nBachelor’s Degree in Computer Science, Engineering or Electrical Engineer\n10+ years of progressively Enterprise Architecture and/or DevOps leadership experiences with large scale outcomes aimed at consumers.\n\n\nPreferred Qualifications\n\nDemonstrated technical vision with strong DevSecOps expertise across large-scale Agile teams. Ability to identify key drivers, core assumptions, and significant trends across a complex, competitive landscape.\nProven experience in leveraging digital, big data, cloud, and AI (Artificial Intelligence) for competitive advantage\nExperience leading teams of greater than 100 people\nExperience with formulating vision and strategy to transform, simplify, and modernize the implementation of customer-facing capabilities\nExperience with underlying application program (API) methods for systems integrations/data exchanges\nCoordination, integration, and testing activities within and outside of the product line\nOperational experience supporting systems in a 24*7 “always on” environment\nDefining analytics to be collected regarding the product, and prioritization of their collection\n\n\nWhat We Can Offer\n\nAs part of the Ford family, you’ll enjoy excellent compensation, and a comprehensive benefits package that includes generous PTO, retirement, savings and stock investment plans, incentive compensation, and much more. You’ll also experience exciting opportunities for professional and personal growth and recognition.\n\nCandidates for positions with Ford Motor Company must be legally authorized to work in the U.S. Verification of employment eligibility will be required at time of hire. Visa sponsorship is not available for this position.\n\nFord Motor Company is an equal opportunity employer committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race, religion, color, age, sex, national origin, sexual orientation, gender identity, disability status or protected veteran status.\n\nAt Ford, the health and safety of our employees is our top priority. Vaccination has been proven to play a critical role in combatting COVID-19. As a result, Ford has made the decision to require U.S. salaried employees to be fully vaccinated against COVID-19, unless employees require an accommodation for religious or medical reasons. Being fully vaccinated means that an individual is at least two weeks past their final dose of an authorized COVID-19 vaccine regimen. As a condition of employment, newly hired employees will be required to provide proof of their COVID-19 vaccination or an approved medical or religious exemption.\n\n Location \n\nDearborn, MI, United States","seniority":"Director","employment_type":"Full-time","location":"Dearborn, MI","url":"https://www.linkedin.com/jobs/view/vp-head-of-enterprise-architecture-research-and-developer-experience-at-ford-motor-company-3383113180","hash":"d2e93fbb99bbfaedcae4cae1feed833e","company_id":9601338,"company_name":"Ford Motor Company","company_url":"https://www.linkedin.com/company/ford-motor-company","external_url":null,"deleted":0,"application_active":1,"salary":null,"applicants_count":"Be among the first 25 applicants","linkedin_job_id":3383113180,"country":"United States","last_updated_ux":1670907757,"redirected_url":"https://www.linkedin.com/jobs/view/vp-head-of-enterprise-architecture-research-and-developer-experience-at-ford-motor-company-3383113180","redirected_url_hash":"d2e93fbb99bbfaedcae4cae1feed833e","job_functions_collection":[{"id":58188423,"job_id":102839215,"function_id":12174,"deleted":0,"created":"2022-12-01 19:11:51","last_updated":"2022-12-01 19:11:51","job_function_list":{"id":12174,"created":"2022-07-05 06:45:20","last_updated":"2022-07-05 06:45:20","function":"Engineering and Information Technology","hash":"c7d4b4730b5f9d1b68036c6bf6f7eb70"}}],"job_industries_collection":[{"id":77498035,"job_id":102839215,"industry_id":483,"deleted":0,"created":"2022-12-01 19:11:51","last_updated":"2022-12-01 19:11:51","job_industry_list":{"id":483,"created":"2022-06-23 08:16:55","last_updated":"2022-06-23 08:16:55","industry":"Motor Vehicle Manufacturing","hash":"d0a588b68f159163841140b259438f96"}}],"job_status_log_collection":[{"id":1435031276,"job_id":102839215,"created":"2022-12-01 19:11:51","last_updated":"2022-12-01 19:19:53","status":"active","deleted":1},{"id":1435070945,"job_id":102839215,"created":"2022-12-01 19:19:52","last_updated":"2022-12-01 19:27:10","status":"active","deleted":1},{"id":1435105561,"job_id":102839215,"created":"2022-12-01 19:27:10","last_updated":"2022-12-03 15:29:00","status":"active","deleted":1},{"id":1444635750,"job_id":102839215,"created":"2022-12-03 15:28:59","last_updated":"2022-12-13 05:02:37","status":"active","deleted":1},{"id":1480647459,"job_id":102839215,"created":"2022-12-13 05:02:37","last_updated":"2022-12-13 05:02:37","status":"active","deleted":0}]},
  {"id":102846462,"created":"2022-12-01 19:26:07","last_updated":"2022-12-16 03:14:15","time_posted":"2 weeks ago","title":"Strategic Alliance Sales Director (CRE): Cyber - Healthcare Technology","description":"Specialty/Competency: IFS - Clients & Markets\n\nIndustry/Sector: Not Applicable\n\nTime Type: Full time\n\nTravel Requirements: Up to 40%\n\nA career in Sales and Marketing, within Internal Firm Services, will provide you with the opportunity to focus on positioning a distinctive PwC brand in the marketplace and drive long term revenue growth for the Firm. You’ll focus on designing, developing, and implementing communication programmes and media events to promote and sell the PwC’s brand and services as well as contribute to and evaluating our pricing strategies in the marketplace. Our Business Development team supports PwC and its clients by developing sales strategies, executing tactics, and securing the resources required to close sales opportunities. As part of the team, you’ll be managing sales pursuits and the sales pipeline, helping the account team in identifying, qualifying and closing sales leads, and coordinating the utilisation of all account management methodology and business development tools.\n\nTo really stand out and make us fit for the future in a constantly changing world, each and every one of us at PwC needs to be a purpose-led and values-driven leader at every level. To help us achieve this we have the PwC Professional; our global leadership development framework. It gives us a single set of expectations across our lines, geographies and career paths, and provides transparency on the skills we need as individuals to be successful and progress in our careers, now and in the future.\n\nResponsibilities\n\nPwC Professional skills and responsibilities for this management level include but are not limited to\n\nAs a Director, you'll work as part of a team of problem solvers, helping to solve complex business issues from strategy to execution.\n\nSupport team to disrupt, improve and evolve ways of working when necessary.\nArrange and sponsor appropriate assignments and experiences to help people realise their potential and support their long-term aspirations.\nIdentify gaps in the market and spot opportunities to create value propositions.\nLook for opportunities to scale efficiencies and new ways of working across multiple projects and environments.\nCreate an environment where people and technology thrive together to accomplish more than they could apart.\nI promote and encourage others to value difference when working in diverse teams.\nDrive and take ownership for developing connections that help deliver what is best for our people and stakeholders.\nInfluence and facilitate the creation of long-term relationships which add value to the firm.\nUphold the firm's code of ethics and business conduct.\n\n\nBasic Qualifications\n\nJob Requirements and Preferences:\n\nCovid-19 Vaccination - At this time, proof of COVID-19 vaccination is a basic qualification for this role. You will be required to confirm that you are fully vaccinated with vaccines approved by the U.S. Food and Drug Administration (\"FDA\") or the World Health Organization (\"WHO\").\n\n\nMinimum Degree Required\n\nGeneral Education Development (GED)\n\nMinimum Years Of Experience\n\n8 year(s)\n\nDegree Preferred\n\nPreferred Qualifications:\n\nBachelor Degree\n\nPreferred Fields Of Study\n\nBusiness Administration/Management, Marketing, Economics, Computer and Information Science\n\nAdditional Educational Preferences\n\nOther business related fields of study may be considered.\n\nPreferred Knowledge/Skills\n\nDemonstrates thought leader-level abilities with, and/or a proven record of success directing efforts including:\n\nExhibiting extensive knowledge of professional services selling and the ability to build and sustain long term relations with Technology Alliances and clients to drive revenue;\nShowcasing success in an individual contributor sales role for a professional services and or technology solution organization;\nUnderstanding of the structure, key issues, language, and environment of one or more industry/sector groups with an ability to discuss and explain current and emerging issues within one or more industry sectors, including services and technology applicable to those needs and effectively engage with executive level clients and with technology-focused PwC resources;\nUtilizing extensive experience and demonstrating effectiveness and success across sales competencies;\nDemonstrating complex Alliance management and team selling;\nInitiating sales calls and contacts; pursuing prospects to secure meetings; winning referrals and exploring sales opportunities;\nSoliciting information from Alliances and clients to effectively qualify and scope opportunities;\nPlaying an active role in discussing and developing solutions with client teams and clients;\nUnderstanding client business issues and matching them to service capabilities/revenue opportunities;\nLeading and coaching complex sales processes through effective targeting of buyers and influencers;\nOvercoming objections and obstacles to win the business, develop and execute a targeted relationship and account development strategy;\nUtilizing sales cycle methodology, account, and relationship development methodology;\nDemonstrating relationship effectiveness, including the ability to establish and develop long-term Alliance, PwC Account Team, and client relationships;\nEffectively representing both Alliance and client needs to establish appropriate solutions are brought to the client;\nBuilding trust with the Alliance;\nSuccessfully navigating a complex internal organization consisting of dozens of distinct capabilities and practices;\nThriving in an unstructured and evolving team and organizational environment;\nDemonstrating personal effectiveness, including a proven ability to accomplish and exceed goals within challenging, complex organizations;\nProjecting executive presence and professionalism sufficient to interact with C-level executives and senior partners;\nRemaining tenacious and undeterred by criticism and setbacks; and,\nMeeting significant targets and goals with minimal oversight and direction on a daily, weekly, or even monthly basic.\n\n\nAt PwC, our work model includes three ways of working: virtual, in-person, and flex (a hybrid of in-person and virtual). Visit the following link to learn more: https://pwc.to/ways-we-work.\n\nPwC does not intend to hire experienced or entry level job seekers who will need, now or in the future, PwC sponsorship through the H-1B lottery, except as set forth within the following policy: https://pwc.to/H-1B-Lottery-Policy.\n\nAll qualified applicants will receive consideration for employment at PwC without regard to race; creed; color; religion; national origin; sex; age; disability; sexual orientation; gender identity or expression; genetic predisposition or carrier status; veteran, marital, or citizenship status; or any other status protected by law. PwC is proud to be an affirmative action and equal opportunity employer.\n\nFor positions based in San Francisco, consideration of qualified candidates with arrest and conviction records will be in a manner consistent with the San Francisco Fair Chance Ordinance.\n\nFor positions in California, Colorado, New York City, Washington State, and Westchester County (NY), please visit the following link for pay range information: https://pwc.to/payrange-v1-ifsdirector","seniority":"Director","employment_type":"Full-time","location":"New Orleans, LA","url":"https://www.linkedin.com/jobs/view/strategic-alliance-sales-director-cre-cyber-healthcare-technology-at-pwc-3375839949","hash":"2470199bc5e0bc8f600d80ce6370f052","company_id":1300765,"company_name":"PwC","company_url":"https://www.linkedin.com/company/pwc","external_url":null,"deleted":0,"application_active":1,"salary":null,"applicants_count":"Be among the first 25 applicants","linkedin_job_id":3375839949,"country":"United States","last_updated_ux":1671160455,"redirected_url":"https://www.linkedin.com/jobs/view/strategic-alliance-sales-director-cre-cyber-healthcare-technology-at-pwc-3375839949","redirected_url_hash":"2470199bc5e0bc8f600d80ce6370f052","job_functions_collection":[{"id":58195257,"job_id":102846462,"function_id":12180,"deleted":0,"created":"2022-12-01 19:26:07","last_updated":"2022-12-01 19:26:07","job_function_list":{"id":12180,"created":"2022-07-05 06:45:26","last_updated":"2022-07-05 06:45:26","function":"Sales and Business Development","hash":"d08fd1f5a38bf960259fd21752590342"}}],"job_industries_collection":[{"id":77505113,"job_id":102846462,"industry_id":509,"deleted":0,"created":"2022-12-01 19:26:07","last_updated":"2022-12-01 19:26:07","job_industry_list":{"id":509,"created":"2022-07-05 08:24:45","last_updated":"2022-07-05 08:24:45","industry":"Financial Services, Business Consulting and Services, and Accounting","hash":"3747388edb186697d1e7be24f17f1351"}}],"job_status_log_collection":[{"id":1435097813,"job_id":102846462,"created":"2022-12-01 19:26:07","last_updated":"2022-12-01 19:34:48","status":"active","deleted":1},{"id":1435138659,"job_id":102846462,"created":"2022-12-01 19:34:48","last_updated":"2022-12-01 20:17:39","status":"active","deleted":1},{"id":1435326753,"job_id":102846462,"created":"2022-12-01 20:17:39","last_updated":"2022-12-01 20:20:34","status":"active","deleted":1},{"id":1435340981,"job_id":102846462,"created":"2022-12-01 20:20:34","last_updated":"2022-12-01 20:28:24","status":"active","deleted":1},{"id":1435372533,"job_id":102846462,"created":"2022-12-01 20:28:24","last_updated":"2022-12-01 20:35:52","status":"active","deleted":1},{"id":1435399729,"job_id":102846462,"created":"2022-12-01 20:35:51","last_updated":"2022-12-03 09:55:55","status":"active","deleted":1},{"id":1443139787,"job_id":102846462,"created":"2022-12-03 09:55:55","last_updated":"2022-12-16 03:14:15","status":"active","deleted":1},{"id":1492166571,"job_id":102846462,"created":"2022-12-16 03:14:15","last_updated":"2022-12-16 03:14:15","status":"active","deleted":0}]},
  {"id":102853409,"created":"2022-12-01 19:35:32","last_updated":"2022-12-16 03:47:57","time_posted":"1 week ago","title":"Workday HCM Director","description":"Specialty/Competency: Workday\n\nIndustry/Sector: Not Applicable\n\nTime Type: Full time\n\nTravel Requirements: Up to 60%\n\nA career in our Workday Human Capital practice, within Workday Consulting services, will provide you with the opportunity to help our clients leverage Workday technology as a tool to enhance and unify Human Resources, talent management, and finance. We focus on understanding the forces shaping their business and developing industry tailored solutions that support our clients through the entire lifecycle of the Workday implementation. In joining, you’ll be a part of a team that helps our clients reinvent the way they process human capital management and drive change across their businesses. Acting as a true business partner, we get to know their business and human capital processes so that we can zero in on bringing them strategic value through productivity and business effectiveness improvements with Workday.\n\nTo really stand out and make us fit for the future in a constantly changing world, each and every one of us at PwC needs to be a purpose-led and values-driven leader at every level. To help us achieve this we have the PwC Professional; our global leadership development framework. It gives us a single set of expectations across our lines, geographies and career paths, and provides transparency on the skills we need as individuals to be successful and progress in our careers, now and in the future.\n\nResponsibilities\n\nPwC Professional skills and responsibilities for this management level include but are not limited to\n\nAs a Director, you'll work as part of a team of problem solvers, helping to solve complex business issues from strategy to execution.\n\nSupport team to disrupt, improve and evolve ways of working when necessary.\nArrange and sponsor appropriate assignments and experiences to help people realise their potential and support their long-term aspirations.\nIdentify gaps in the market and spot opportunities to create value propositions.\nLook for opportunities to scale efficiencies and new ways of working across multiple projects and environments.\nCreate an environment where people and technology thrive together to accomplish more than they could apart.\nI promote and encourage others to value difference when working in diverse teams.\nDrive and take ownership for developing connections that help deliver what is best for our people and stakeholders.\nInfluence and facilitate the creation of long-term relationships which add value to the firm.\nUphold the firm's code of ethics and business conduct.\n\n\nMinimum Degree Required\n\nBachelor Degree\n\nMinimum Years Of Experience\n\n10 year(s)\n\nDegree Preferred\n\nPreferred Qualifications:\n\nMaster Degree\n\nPreferred Fields Of Study\n\nBusiness Administration/Management, Human Resources Management, Organizational Management, Computer and Information Science\n\nCertification(s) Preferred\n\nGlobal Professional in Human Resources (GPHR), and/or a Senior Professional in Human Resources (SPHR) certification, Workday Services functional certification and/or engagement manager certification\n\nPreferred Knowledge/Skills\n\nDemonstrates proven prior success in roles managing or utilizing Workday directly for at least three years. Demonstrates proven expertise with, and extensive success in roles with increasing leadership to manage, assisting large employers with improving the performance of their HR organization. This includes improving the delivery of HR services, implementing HR technologies, aligning HR strategy and people strategies with business strategies, streamlining and standardizing HR policies, practices and processes, transforming the HR organization to be more effective in managing human capital and supporting the business units.\n\nDemonstrates Expert-level Abilities And Proven Success With Leading Several Global And/or Enterprise-wide Implementations, Acting As The Global Program Manager Or Functional Product Lead, Which Includes Leveraging The Following Areas And Skill Sets\n\nAssessment, design and delivery of a client's current HCM (Talent, Compensation, Etc.) processes based on leading practices;\nThird party integrations and functionality and impact of these integrations;\nHCM strategy and transformation consulting across people, process and organization enabled by technology;\nTechnical acumen of the Workday system configuration, especially cloud integrations;\nManagement of teams with multiple work streams;\nDesign of designing deliverables and proposals that address client needs within the professional services industry;\nStrategy development - as well as leveraging PC applications (i.e. Microsoft Word, Excel, PowerPoint and Project) and business levels of fluency in multiple languages - to write, communicate, facilitate, and present cogently; to and/or for all levels of industry audiences, clients and internal staff and management, including development and delivery of business proposals, conferences and whitepapers;\nIdentification and addressing client needs: building, maintaining, and utilizing networks of client relationships and community involvement; communicating value propositions; managing resource requirements, project workflow, budgets, billing and collections; and preparing and/or coordinating complex written and verbal materials; and\nTeam leadership: supervising teams to create an atmosphere of trust; seeking diverse views to encourage improvement and innovation; and coaching staff including providing timely meaningful written and verbal feedback.\n\n\nAt PwC, our work model includes three ways of working: virtual, in-person, and flex (a hybrid of in-person and virtual). Visit the following link to learn more: https://pwc.to/ways-we-work.\n\nPwC does not intend to hire experienced or entry level job seekers who will need, now or in the future, PwC sponsorship through the H-1B lottery, except as set forth within the following policy: https://pwc.to/H-1B-Lottery-Policy.\n\nAll qualified applicants will receive consideration for employment at PwC without regard to race; creed; color; religion; national origin; sex; age; disability; sexual orientation; gender identity or expression; genetic predisposition or carrier status; veteran, marital, or citizenship status; or any other status protected by law. PwC is proud to be an affirmative action and equal opportunity employer.\n\nFor positions based in San Francisco, consideration of qualified candidates with arrest and conviction records will be in a manner consistent with the San Francisco Fair Chance Ordinance.\n\nFor positions in Colorado, visit the following link for information related to Colorado's Equal Pay for Equal Work Act: https://pwc.to/coloradoadvisorydirector.\n\nFor positions in New York City, visit the following link for pay range information: https://pwc.to/payrange-a-advisorydirector","seniority":"Director","employment_type":"Full-time","location":"Orlando, FL","url":"https://www.linkedin.com/jobs/view/workday-hcm-director-at-pwc-3375844453","hash":"53b6d2e18ac29bcf070f6fa4fd50c46d","company_id":1300765,"company_name":"PwC","company_url":"https://www.linkedin.com/company/pwc","external_url":null,"deleted":1,"application_active":1,"salary":null,"applicants_count":"Be among the first 25 applicants","linkedin_job_id":3375844453,"country":"United States","last_updated_ux":1671162477,"redirected_url":"https://www.linkedin.com/jobs/view/workday-hcm-director-at-pwc-3375844453","redirected_url_hash":"53b6d2e18ac29bcf070f6fa4fd50c46d","job_functions_collection":[{"id":58201843,"job_id":102853409,"function_id":32,"deleted":1,"created":"2022-12-01 19:35:32","last_updated":"2022-12-01 19:35:32","job_function_list":{"id":32,"created":"2020-08-14 14:11:48","last_updated":"2020-08-14 14:11:48","function":"Human Resources","hash":"d19092ef5301d9548911f87a817f8c44"}}],"job_industries_collection":[{"id":77511876,"job_id":102853409,"industry_id":509,"deleted":1,"created":"2022-12-01 19:35:32","last_updated":"2022-12-01 19:35:32","job_industry_list":{"id":509,"created":"2022-07-05 08:24:45","last_updated":"2022-07-05 08:24:45","industry":"Financial Services, Business Consulting and Services, and Accounting","hash":"3747388edb186697d1e7be24f17f1351"}}],"job_status_log_collection":[{"id":1435144696,"job_id":102853409,"created":"2022-12-01 19:35:32","last_updated":"2022-12-01 19:50:35","status":"active","deleted":1},{"id":1435217768,"job_id":102853409,"created":"2022-12-01 19:50:35","last_updated":"2022-12-01 20:11:24","status":"active","deleted":1},{"id":1435304451,"job_id":102853409,"created":"2022-12-01 20:11:23","last_updated":"2022-12-01 20:19:55","status":"active","deleted":1},{"id":1435337179,"job_id":102853409,"created":"2022-12-01 20:19:54","last_updated":"2022-12-01 20:36:22","status":"active","deleted":1},{"id":1435403220,"job_id":102853409,"created":"2022-12-01 20:36:22","last_updated":"2022-12-01 20:51:25","status":"active","deleted":1},{"id":1435463331,"job_id":102853409,"created":"2022-12-01 20:51:24","last_updated":"2022-12-03 12:02:37","status":"active","deleted":1},{"id":1443703794,"job_id":102853409,"created":"2022-12-03 12:02:37","last_updated":"2022-12-13 05:21:37","status":"active","deleted":1},{"id":1480687809,"job_id":102853409,"created":"2022-12-13 05:21:37","last_updated":"2022-12-16 03:47:57","status":"active","deleted":1},{"id":1492255180,"job_id":102853409,"created":"2022-12-16 03:47:56","last_updated":"2022-12-16 03:47:57","status":"deleted","deleted":0}]},
  {"id":102963693,"created":"2022-12-02 01:34:13","last_updated":"2022-12-16 04:11:47","time_posted":"2 weeks ago","title":"Sales director","description":"Job Description (Please Provide Summary Of The Position)\n\nWorked in the procurement function at a senior position\nSuccessful track record of selling a SaaS product used in the procurement function of organizations\nAbility to be in contact with different stakeholders from middle to top management (CFO, CPO, Sourcing Directors, etc.)\nConsistent and documented track record for achieving monthly/quarterly/annual target metrics\nStrong presentation and negotiations experience\n\n\nResponsibilities: Click here to enter text.\n\nIdentify and build new prospects/business opportunities for a SaaS product in new and existing markets\nGrowing revenue via prospecting, qualifying, selling, and closing enterprise client accounts\nDevelop strong relationships with key stakeholders from middle to top management\nProviding a consultative solution in the Source to Pay function to prospects\nPlanning & strategizing marketing activities with the Marketing and Partnerships teams\nStaying up to date with the latest procurement industry trends & best practices\n\n\nAll offers of employment extended to applicants will be conditional and will require, among other things, that the recipient of the offer of employment submit proof that s/he is fully vaccinated at that time or will submit such proof prior to determining a start date. Individuals with medical issues or sincere religious beliefs that prevent them from getting the vaccine may request an exemption from the vaccine requirement. To the extent State legislation or executive action purports to limit TCS’s ability to require vaccination for individuals who object on a basis other than medical issues or sincere religious beliefs, individual requests for an exception to TCS’s generally applicable vaccination policy pursuant to such action will also be considered. Individuals who receive an exemption from vaccination for any reason may be required to comply with other Covid precautions.”","seniority":"Director","employment_type":"Full-time","location":"Santa Clara, CA","url":"https://www.linkedin.com/jobs/view/sales-director-at-tata-consultancy-services-3380328640","hash":"50101e9a0f9ee3ff5f7a0a2661ac588f","company_id":2667274,"company_name":"Tata Consultancy Services","company_url":"https://www.linkedin.com/company/tata-consultancy-services","external_url":"https://ibegin.tcs.com/iBegin/jobs/252832J","deleted":0,"application_active":1,"salary":null,"applicants_count":"29 applicants","linkedin_job_id":3380328640,"country":"United States","last_updated_ux":1671163907,"redirected_url":"https://www.linkedin.com/jobs/view/sales-director-at-tata-consultancy-services-3380328640","redirected_url_hash":"50101e9a0f9ee3ff5f7a0a2661ac588f","job_functions_collection":[{"id":58307862,"job_id":102963693,"function_id":12180,"deleted":0,"created":"2022-12-02 01:34:13","last_updated":"2022-12-02 01:34:13","job_function_list":{"id":12180,"created":"2022-07-05 06:45:26","last_updated":"2022-07-05 06:45:26","function":"Sales and Business Development","hash":"d08fd1f5a38bf960259fd21752590342"}}],"job_industries_collection":[{"id":77635205,"job_id":102963693,"industry_id":421,"deleted":0,"created":"2022-12-02 01:34:13","last_updated":"2022-12-02 01:34:13","job_industry_list":{"id":421,"created":"2022-06-22 07:28:22","last_updated":"2022-06-22 07:28:22","industry":"IT Services and IT Consulting","hash":"a21b8330e90140228cb4a654461ef546"}}],"job_status_log_collection":[{"id":1436212816,"job_id":102963693,"created":"2022-12-02 01:34:13","last_updated":"2022-12-02 01:49:57","status":"active","deleted":1},{"id":1436247717,"job_id":102963693,"created":"2022-12-02 01:49:56","last_updated":"2022-12-02 02:27:50","status":"active","deleted":1},{"id":1436345959,"job_id":102963693,"created":"2022-12-02 02:27:49","last_updated":"2022-12-02 02:52:27","status":"active","deleted":1},{"id":1436412639,"job_id":102963693,"created":"2022-12-02 02:52:27","last_updated":"2022-12-03 15:37:26","status":"active","deleted":1},{"id":1444675076,"job_id":102963693,"created":"2022-12-03 15:37:26","last_updated":"2022-12-13 06:07:17","status":"active","deleted":1},{"id":1480773798,"job_id":102963693,"created":"2022-12-13 06:07:16","last_updated":"2022-12-16 04:11:47","status":"active","deleted":1},{"id":1492329860,"job_id":102963693,"created":"2022-12-16 04:11:47","last_updated":"2022-12-16 04:11:47","status":"active","deleted":0}]},
  {"id":103114077,"created":"2022-12-02 13:28:12","last_updated":"2022-12-16 09:04:23","time_posted":"55 minutes ago","title":"Audit Director","description":"At Deloitte, we deliver the solutions and insights our clients need to address their most complex business challenges. As the world’s largest global professional services and consulting network, Deloitte Ireland has nearly 3,000 people providing audit & assurance, tax and legal, consulting, risk advisory, and corporate finance services to public and private clients spanning multiple industries. \n\nOur Audit and Assurance practice is a market leading player delivering a range of audit and advisory services to a broad range of national and international clients in every business sector. Our professionals’ primary focus is adding value to businesses while applying the highest standards of professional integrity, objectivity, independence and technical excellence.\n\nAt Deloitte, we trust our people to make the right choices around how, where and when they work. Our empowered hybrid way of working allows you to be collaborative, learn from colleagues, share your experiences, build the relationships that will fuel your career and work on individual projects in a way that works for you and our clients. Deloitte Works is built on trust and allows our people to have flexibility and control in how they work. If you apply for a role, please speak to your recruiter or hiring manager to discuss hybrid working and how it could work for you. Read more about Deloitte Works here.\n\nDeloitte will ensure any reasonable accommodations are implemented as part of the recruitment and selection process.\n\nDeloitte is an equal opportunities employer.\n\nService Line: CTB\n\nOur Consumer and Technology Business practice is committed to excellence, with quality and innovation top priorities in the services we deliver, providing greater value to our clients across industries such as manufacturing, distribution, pharmaceuticals, retail, media, technology and property.\n\nYour role:\n\nAs a Director in the Audit & Assurance practice, you will focus on the management and delivery of client engagements, as well as sales and practice development. In this role, you will develop high-performing people and teams, leading and supporting them to make an impact that matters and setting the direction to deliver exceptional client service. Someone of your knowledge and know-how will also be expected to:\n\nDevelop a personal growth plan/strategy around a portfolio of potential new clients/new business;\nIdentify and lead proposals for new clients and projects;\nSupervise, develop and motivate managers staff, including coaching and career guidance;\nIdentify and lead integration of overseas resources (i.e. delivery centres) to drive efficient execution;\nActively monitor and manage engagement economics such that revenue is recognised appropriately throughout the engagement;\nDrive the delivery of services in a timely and effective way, exceeding our clients’ quality expectations;\nEffectively work in an agile environment;\nConsult and advise our clients on technical accounting, auditing and internal control matters;\nDevelop, maintain and leverage internal contacts across Deloitte businesses; and\nStay connected to market trends to think through future innovative solutions.\n\n\nYour professional experience:\n\nEssential:\n\nACA/ACCA qualification (or equivalent)\nExtensive experience of working with IFRS, UK, US GAAP or equivalent reporting standards\nThe ability to present client data in a clear and concise format\nAbility to develop effective client relationships, in particular establishing rapport, trust and confidence with stakeholders\nProject management experience\nProven leadership skills demonstrating strong judgment, problem-solving, and decision-making abilities\nExperience working in a fast-paced, team environment\nAbility to develop and motivate teams with team members at all levels\nExperience working independently on multiple assignments or engagements, even in a virtual environment\n\n\nDesirable:\n\nPCAOB experience is desirable, however this is not essential","seniority":"Director","employment_type":"Full-time","location":"Dublin, County Dublin, Ireland","url":"https://www.linkedin.com/jobs/view/audit-director-at-deloitte-3384164768","hash":"3ce14f36c027e7b87551ca4d7aae32c2","company_id":11825328,"company_name":"Deloitte","company_url":"https://www.linkedin.com/company/deloitte","external_url":"https://deloitteie.wd3.myworkdayjobs.com/Experienced_Professionals/job/Dublin/Audi-Director_106748","deleted":0,"application_active":1,"salary":null,"applicants_count":"Be among the first 25 applicants","linkedin_job_id":3384164768,"country":"Ireland","last_updated_ux":1671181463,"redirected_url":"https://www.linkedin.com/jobs/view/audit-director-at-deloitte-3384164768","redirected_url_hash":"3ce14f36c027e7b87551ca4d7aae32c2","job_functions_collection":[{"id":58451023,"job_id":103114077,"function_id":12175,"deleted":0,"created":"2022-12-02 13:28:12","last_updated":"2022-12-02 13:28:12","job_function_list":{"id":12175,"created":"2022-07-05 06:45:20","last_updated":"2022-07-05 06:45:20","function":"Accounting/Auditing and Finance","hash":"5379cbb2ef9a8818862ad709ad57ff03"}}],"job_industries_collection":[{"id":77792138,"job_id":103114077,"industry_id":61,"deleted":1,"created":"2022-12-02 13:28:12","last_updated":"2022-12-02 13:28:12","job_industry_list":{"id":61,"created":"2020-08-14 14:12:01","last_updated":"2020-08-14 14:12:01","industry":"Legal Services","hash":"a254bdfbf9fdf6e4f2dc020fa1b84115"}},{"id":81375360,"job_id":103114077,"industry_id":440,"deleted":0,"created":"2022-12-13 07:48:08","last_updated":"2022-12-13 07:48:08","job_industry_list":{"id":440,"created":"2022-06-22 07:33:23","last_updated":"2022-06-22 07:33:23","industry":"Business Consulting and Services","hash":"70fea98f107cd34b7a1282c4a48d6ace"}}],"job_status_log_collection":[{"id":1438652879,"job_id":103114077,"created":"2022-12-02 13:28:12","last_updated":"2022-12-03 18:22:49","status":"active","deleted":1},{"id":1445399004,"job_id":103114077,"created":"2022-12-03 18:22:49","last_updated":"2022-12-13 07:48:08","status":"active","deleted":1},{"id":1480934648,"job_id":103114077,"created":"2022-12-13 07:48:08","last_updated":"2022-12-16 04:26:08","status":"active","deleted":1},{"id":1492367743,"job_id":103114077,"created":"2022-12-16 04:26:07","last_updated":"2022-12-16 09:04:23","status":"active","deleted":1},{"id":1493233557,"job_id":103114077,"created":"2022-12-16 09:04:22","last_updated":"2022-12-16 09:04:23","status":"active","deleted":0}]},
  {"id":103146117,"created":"2022-12-02 15:01:58","last_updated":"2022-12-16 04:58:09","time_posted":"1 week ago","title":"Art Director","description":"At EY, you’ll have the chance to build a career as unique as you are, with the global scale, support, inclusive culture and technology to become the best version of you. And we’re counting on your unique voice and perspective to help EY become even better, too. Join us and build an exceptional experience for yourself, and a better working world for all.\n\nAt EY, you’ll have the chance to build a career as unique as you are, with the global scale, support, inclusive culture and technology to become the best version of you. And we’re counting on your unique voice and perspective to help EY become even better, too. Join us and build an exceptional experience for yourself, and a better working world for all.\n\nAt EY Global Delivery Services (GDS), we work hand in hand with the business to build awareness of our services and solutions; to bring our purpose — building a better working world — to life for our people, clients and communities; to engage our people and build a high performing culture; and to build the commercial value and emotional resonance of the EY and the GDS brand.\n\nThe opportunity\n\nEY GDS Creative Center of Excellence (CoE) is an inhouse agency that helps EY teams build a better working world by delivering high-impact, high-quality and on–brand creative solutions. People in the CoE help create experiences that are not just creatively inspiring, but also strategically precise and deeply human — across multiple media platforms.\n\nAs an Art Director, you will have a unique blend of creative vision and strategic thinking, to lead our team and will act as a strong creative strategist and a design thought leader.\n\nYou will own the creative and visual direction and design for creative collaterals across multiple formats, ensuring that all creatives are on-brand, user-centric and aesthetically proficient. With a passion for problem-solving and creative strategy, you lead creative brainstorms with stakeholders and content and digital marketing teams to produce best-in-class creatives that intrinsically align with the EY brand and business objectives. With your impeccable aesthetic sense and design sensibility, you are a versatile and reliable leader who can elevate any creative conceptualization, storyboard or creative direction for projects across multiple channels.\n\nYour Key Responsibilities\n\nYou understand the power of creative ideas and have a track-record of delivering memorable ideas that shape audience perception, engagement, and participation\nYou help coach and train the wider team, transforming GDS Creative Services capability from providing excellent design and execution services, to leading with brand-building and distinctive creative ideas and strategy\nHave experience leading teams in creative agencies or in-house brand teams, championing high-visibility campaigns for top global brands (preferably B2B)\nProvide creative leadership to the design teams to deliver a range of collaterals (i.e., brochures, placemats, illustration, layouts, infographics, on-screen presentations, proposals, microsites, motion graphic content and social media collaterals)\nProduce strategically sound conceptual work and bring it to life through rapid prototyping and storyboard creation and all the way through post-production\nAdhere to EY brand guidelines, meet, and exceed defined expectations in terms of aesthetics, quality, turnaround time, budget and efficiency\nStay up-to-date with current and future designs, web standards, concepts and industry trends and advocate the same to team members and customers\nProvide creative and art direction support to the team, coordinate with team members and others to resolve issues, as necessary\nProactively identify opportunities to employ pop culture trends, creativity, executional approaches and techniques to create exceptional user experiences\nCommunicate effectively with various customers/customer groups while understanding design briefs and sharing ideas\nLead project discussions with customers with a customer-centric mindset\nProvide unique and innovative design solutions to customers and convince them to make the right design choices\nPrioritize deadlines and effectively manage multiple creative projects parallelly\nBe a part and contribute towards various organizational initiatives\n\n\nSkills And Attributes For Success\n\nA user-centric mindset with creative, innovative and analytical approach\nWorking knowledge of creating infographics and data visualization techniques\nExceptional project management, risk management and team management\nProven track record of delivering high-quality output on time and within budget\nAn innovative mindset that takes a client problem and delivers compelling and inspiring creative solutions\nExcellent communication (comprehension, verbal and written) and interpersonal skills with the ability to communicate and persuade\nExceptional attention to detail\nUnderstanding of current and future visual trends\n\n\nTo qualify for the role, you must have: \n\nBachelor’s degree or college diploma (preferably in Graphic Design or related discipline)\nProficiency in Adobe Illustrator, Adobe Photoshop, and Adobe InDesign, Adobe DC and Microsoft Office (PowerPoint, Word and Excel)\nExperience across a range of digital, social, and integrated media\nKnowledge of social platforms (Twitter, LinkedIn, Instagram, YouTube, Facebook, Pinterest etc.)\nAt least 12 years of overall experience in a fast-paced global environment\nPrior art direction experience in leading agencies\n\n\nIdeally, you’ll also have:\n\nWorking knowledge of other key software and tools relevant to the industry\n\n\nWhat we look for: \n\nStrong business acumen along with creative vision\nCreative problem-solving mindset with a flexible can-do attitude\nA growth mindset creative who loves to collaborate, ideate and deliver breakthrough work\nExperience in leading and managing creative teams, as well as developing junior creative talent\nSelf-starter who loves challenges and makes big things happen by working together\nExperience working with global clients\nConfidence, maturity and ability to build strong client relationships\nA strong team player who is comfortable working collaboratively with others\n\n\nWhat We Offer\n\nEY GDS is a dynamic and truly global delivery network. We work across six locations – Argentina, China, India, the Philippines, Poland and the UK – and with teams from all EY service lines, geographies and sectors, playing a vital role in the delivery of the EY growth strategy. From accountants to coders to creative consultants, we offer a wide variety of fulfilling career opportunities that span all business disciplines. In GDS, you will collaborate with EY teams on exciting projects and work with well-known brands from across the globe. We’ll introduce you to an ever-expanding ecosystem of people, learning, skills and insights that will stay with you throughout your career.\n\nContinuous learning: You’ll develop the mindset and skills to navigate whatever comes next.\nSuccess as defined by you: We’ll provide the tools and flexibility, so you can make a meaningful impact, your way.\nTransformative leadership: We’ll give you the insights, coaching and confidence to be the leader the world needs.\nDiverse and inclusive culture: You’ll be embraced for who you are and empowered to use your voice to help others find theirs.\n\n\nEY | Building a better working world \n\nEY exists to build a better working world, helping to create long-term value for clients, people and society and build trust in the capital markets.\n\nEnabled by data and technology, diverse EY teams in over 150 countries provide trust through assurance and help clients grow, transform and operate.\n\nWorking across assurance, consulting, law, strategy, tax and transactions, EY teams ask better questions to find new answers for the complex issues facing our world today.","seniority":"Director","employment_type":"Full-time","location":"Kanayannur, Kerala, India","url":"https://www.linkedin.com/jobs/view/art-director-at-ey-3384308683","hash":"b428532281b4bc0ba1fff78b02984f45","company_id":6146667,"company_name":"EY","company_url":"https://www.linkedin.com/company/ernstandyoung","external_url":"https://careers.ey.com/ey/job/Kochi-Art-Director-KL-682030/844470701/?feedId=337401&utm_source=LinkedInJobPostings&utm_campaign=j2w_linkedin","deleted":0,"application_active":1,"salary":null,"applicants_count":"41 applicants","linkedin_job_id":3384308683,"country":"India","last_updated_ux":1671166689,"redirected_url":"https://www.linkedin.com/jobs/view/art-director-at-ey-3384308683","redirected_url_hash":"b428532281b4bc0ba1fff78b02984f45","job_functions_collection":[{"id":58480994,"job_id":103146117,"function_id":12190,"deleted":0,"created":"2022-12-02 15:01:58","last_updated":"2022-12-02 15:01:58","job_function_list":{"id":12190,"created":"2022-07-05 06:45:37","last_updated":"2022-07-05 06:45:37","function":"Design, Art/Creative, and Information Technology","hash":"93febdc5b1277b2c29247f9ba10f881f"}}],"job_industries_collection":[{"id":77822429,"job_id":103146117,"industry_id":63,"deleted":1,"created":"2022-12-02 15:01:58","last_updated":"2022-12-02 15:01:58","job_industry_list":{"id":63,"created":"2020-08-14 14:12:03","last_updated":"2020-08-14 14:12:03","industry":"Accounting","hash":"9bbd45bad55cfc620803907f2d8a0217"}},{"id":81394499,"job_id":103146117,"industry_id":424,"deleted":0,"created":"2022-12-13 09:27:03","last_updated":"2022-12-13 09:27:03","job_industry_list":{"id":424,"created":"2022-06-22 07:28:38","last_updated":"2022-06-22 07:28:38","industry":"Professional Services","hash":"e507bdb98979e3376dd8b109cbbb2ec3"}}],"job_status_log_collection":[{"id":1439114056,"job_id":103146117,"created":"2022-12-02 15:01:58","last_updated":"2022-12-03 15:23:36","status":"active","deleted":1},{"id":1444612636,"job_id":103146117,"created":"2022-12-03 15:23:35","last_updated":"2022-12-13 09:27:03","status":"active","deleted":1},{"id":1481293738,"job_id":103146117,"created":"2022-12-13 09:27:03","last_updated":"2022-12-16 04:58:09","status":"active","deleted":1},{"id":1492469307,"job_id":103146117,"created":"2022-12-16 04:58:09","last_updated":"2022-12-16 04:58:09","status":"active","deleted":0}]},
  {"id":103152789,"created":"2022-12-02 15:35:25","last_updated":"2022-12-16 04:46:30","time_posted":"1 week ago","title":"Head of Product Operations","description":"About This Role\n\nWells Fargo is seeking a Head of Product Operations to accelerate transformation of our Home Lending business. Product Operations is a new function that focuses on defining and driving our operating model to create a repeatable and scalable methodology for delivering outcomes.\n\nLearn more about the career areas and lines of business at wellsfargojobs.com .\n\nIn This Role, You Will\nHire and develop a team of Product Operations professionals to accelerate and streamline our digital transformation.\nDocument and continually improve our operating model, including integration with enterprise policies and procedures.\nTransform our communication practices and artifacts to drive clarity and consistency, including c-level visibility into ROI.\nLead monthly portfolio planning and recommend tradeoff decisions regarding investments.\nStreamline our toolchain to \"digitize\" how we collaborate as a team.\nDefine and execute against our talent strategy, performance standards, and learning and development programming.\n Due to a city-wide mandate in New York City, all individuals who perform in-person work or interact with the public during business must be fully vaccinated against COVID-19 or qualify for an approved accommodation to be exempt from being fully vaccinated. Currently, this position falls under the scope of this mandate.\n\nRequired Qualifications\n6+ years of Product Management, product development, strategic planning, process management, change delivery, or equivalent demonstrated through one or a combination of the following: work experience, training, military experience, education\n3+ years Management experience\n  Desired qualifications: \n6+ years working with product, design, and engineering teams in an agile environment.\n5+ years working in a digital-native organization or leading a digital transformation initiative\nPrevious experience presenting to and working with C-Suite executives and senior leaders\n  Job Expectations: \nAbility to travel up to 10% of the time\n This position is not eligible for Visa sponsorship.\n\n Posting Location(s): \n\n1525 W W T Harris Blvd. - Charlotte, NC\n\n2850 S Price Rd. - Chandler, AZ\n\n4101 Wiseman Blvd. - San Antonio, TX\n\n2701 Wells Fargo Way - Minneapolis, MN\n\n3476 Stateview Blvd. - Fort Mill, SC\n\n800 S Jordan Creek Pkwy. - West Des Moines, IA\n\n150 E 42nd St. - New York, New York\n\n550 California St. - San Francisco, CA\n\nPreferred locations listed above. Other locations within the Wells Fargo footprint may be considered. Relocation assistance is available for this position.\n\nPay Range\n\nCharlotte, North Carolina - Pay Range: $120,400 - $250, 000 Annually\n\nNew York, New York - Pay Range: $138,500 - $287,600 Annually\n\nSalary range is determined by location of the job. May be considered for a discretionary bonus, Restricted Share Rights, or other long - term incentive awards.\n\nPlease note: Based on the volume of applications received, this job posting may be removed prior to the indicated close date.\n\nBenefits\nInformation about Wells Fargo's employee benefits\n  Pay Range \n\n$120,400.00 - $250,000.00 Annual\n\nBenefits\nInformation about Wells Fargo's employee benefits\n  We Value Diversity \n\nAt Wells Fargo, we believe in diversity, equity and inclusion in the workplace; accordingly, we welcome applications for employment from all qualified candidates, regardless of race, color, gender, national origin, religion, age, sexual orientation, gender identity, gender expression, genetic information, individuals with disabilities, pregnancy, marital status, status as a protected veteran or any other status protected by applicable law.\n\nEmployees support our focus on building strong customer relationships balanced with a strong risk mitigating and compliance-driven culture which firmly establishes those disciplines as critical to the success of our customers and company. They are accountable for execution of all applicable risk programs (Credit, Market, Financial Crimes, Operational, Regulatory Compliance), which includes effectively following and adhering to applicable Wells Fargo policies and procedures, appropriately fulfilling risk and compliance obligations, timely and effective escalation and remediation of issues, and making sound risk decisions. There is emphasis on proactive monitoring, governance, risk identification and escalation, as well as making sound risk decisions commensurate with the business unit's risk appetite and all risk and compliance program requirements.\n\nCandidates applying to job openings posted in US: All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.\n\nReference Number\n\nR-201471-4","seniority":"Director","employment_type":"Full-time","location":"Minneapolis, MN","url":"https://www.linkedin.com/jobs/view/head-of-product-operations-at-wells-fargo-3384327958","hash":"87a6d206a7c8ed61f114f41dbb0269a0","company_id":5763468,"company_name":"Wells Fargo","company_url":"https://www.linkedin.com/company/wellsfargo","external_url":null,"deleted":0,"application_active":1,"salary":null,"applicants_count":"Be among the first 25 applicants","linkedin_job_id":3384327958,"country":"United States","last_updated_ux":1671165990,"redirected_url":"https://www.linkedin.com/jobs/view/head-of-product-operations-at-wells-fargo-3384327958","redirected_url_hash":"87a6d206a7c8ed61f114f41dbb0269a0","job_functions_collection":[{"id":58486988,"job_id":103152789,"function_id":12182,"deleted":0,"created":"2022-12-02 15:35:25","last_updated":"2022-12-02 15:35:25","job_function_list":{"id":12182,"created":"2022-07-05 06:45:30","last_updated":"2022-07-05 06:45:30","function":"Product Management and Marketing","hash":"7bcf4e21ffa9ca4e158a2750d6ae061b"}}],"job_industries_collection":[{"id":77828503,"job_id":103152789,"industry_id":423,"deleted":0,"created":"2022-12-02 15:35:25","last_updated":"2022-12-02 15:35:25","job_industry_list":{"id":423,"created":"2022-06-22 07:28:32","last_updated":"2022-06-22 07:28:32","industry":"Banking, Financial Services, and Investment Management","hash":"66b974ea092116e00265a7948e422748"}}],"job_status_log_collection":[{"id":1439264774,"job_id":103152789,"created":"2022-12-02 15:35:25","last_updated":"2022-12-02 15:47:27","status":"active","deleted":1},{"id":1439323043,"job_id":103152789,"created":"2022-12-02 15:47:26","last_updated":"2022-12-02 15:55:46","status":"active","deleted":1},{"id":1439368723,"job_id":103152789,"created":"2022-12-02 15:55:46","last_updated":"2022-12-02 16:36:18","status":"active","deleted":1},{"id":1439560141,"job_id":103152789,"created":"2022-12-02 16:36:17","last_updated":"2022-12-02 16:57:37","status":"active","deleted":1},{"id":1439667646,"job_id":103152789,"created":"2022-12-02 16:57:36","last_updated":"2022-12-03 16:39:14","status":"active","deleted":1},{"id":1444945769,"job_id":103152789,"created":"2022-12-03 16:39:13","last_updated":"2022-12-13 12:14:48","status":"active","deleted":1},{"id":1481792701,"job_id":103152789,"created":"2022-12-13 12:14:47","last_updated":"2022-12-16 04:46:30","status":"active","deleted":1},{"id":1492429712,"job_id":103152789,"created":"2022-12-16 04:46:29","last_updated":"2022-12-16 04:46:30","status":"active","deleted":0}]},
  {"id":103214576,"created":"2022-12-02 18:48:24","last_updated":"2022-12-16 05:19:54","time_posted":"1 week ago","title":"Senior Director of Sales BPS","description":"Sales Director will be responsible for cultivating BPO/BPS presence in the market and growing business development opportunities. It is expected that the successful candidate will bring significant experience, relationships and previous success selling BPO. The successful candidate should be motivated by winning financial incentives as well as career growth.\n\n\nA successful candidate will be responsible for sales for BPO offerings (15+ years of post-qualification experience. Minimum 10 years in BPO preferably in a 3rd party BPO environment.\n\n\nKey responsibilities include:\nDrive pursuit towards New logo hunting\nBe responsible for following of allocated accounts\nBe responsible for the sales cycle from deal origination to closure (signed contract) and successful handover to the Operation Management\nBring an understanding of the marketplace and competitor offerings to drive WIPRO’s growth strategy and investments\nBe responsible for New logo sales and account acquisition\nBe responsible for significantly growing Wipro’s presence and revenues\nCollaborate and develop 3rd party and advisor relations to build credible Wipro’s voice in the geography. generate opportunities from this channel\nPropose - Submit and handle proposals with full ownership and accountability for the opportunity. Work closely with the sales enablement teams to ensure high quality of proposals.\nPossess established and current relationships with COO’s, CFO’s, CEO’s, Customer Service Directors.\nBring substantial experience in working with C-Suite executives including discussions with Chief Operating Officers, Chief Marketing Officers and Chief Financial Officers.\nEnsure optimal deployment of resources to achieve business goals\nArchitecture of proposals (RFP/RFIs) to evince client interest\n\n\nKey skills required:\nEfficiency in computers – MS Office and Accounting applications like PeopleSoft, Oracle, etc.\nKnowledge of complex accounting and reporting systems\n \nBusiness Skills:\nBig-deal experience – Person should have proven experience in closing deals with ACV > $5M and TCV > $20M.\nBalance multiple, concurrent deals to achieve challenging growth targets.\nBroad functional knowledge within the specific sector and able to connect with a variety of executive level stakeholders on their specific pain-points.\nEffectively identify and translate client needs into WIPRO services. Develop an understanding of customers’ business needs, matching them with WIPRO’s capabilities, and developing winning proposals for WIPRO.\nWork effectively across the WIPRO organization and partner with the appropriate team members to demonstrate the depth and breadth of WIPRO’s solutions.\nBe a key intermediary between the service delivery team and the customer.\nAstute at identifying and qualifying leads, be able to develop strong relationships at potential client organizations and have the proven ability to convert these relationships into commercial engagements in situations where little to no previous relationship existed.\nEffectively and proactively managed client’s expectations, built deep client partnerships, and developed excellent communication and executive presence to connect at all levels in the organization.\nExperience in selling long term complex multimillion dollar products, services, or solutions within the specific markets.\nAbility to communicate confidently at the C-level to build meaningful internal and external relationships.\n\n\nSoft Skills:\nStrategically minded and able to create a consultative and solution-minded sales environment.\nAggressive, high-energy style who is motivated by winning.\nA “quick study” and “self-starter” – leads with an impatience for the status quo and a true sense of urgency…a forward thinker constantly focused on shaping the organization to meet and anticipate both near and long-term business issues\nDemonstrated ability to work in a multicultural global environment.\nStrong Communication & Interpersonal Skills\nAdvanced presentation skills, coupled with solid executive presence and the ability to establish immediate credibility\nGood people management skills - highly professional in dealings with clients and co-workers\nAbility to deal with unexpected and/or delicate situations calmly and with sound judgment\nAbility to manage multiple projects and meet deadlines under pressure\nAbility to communicate effectively at all levels\nDemonstrated ability to work in a multicultural global environment.","seniority":"Director","employment_type":"Full-time","location":"United States","url":"https://www.linkedin.com/jobs/view/senior-director-of-sales-bps-at-wipro-3377659526","hash":"2c94fd48902f72e8cd4e9fb7331faf56","company_id":5806914,"company_name":"Wipro","company_url":"https://www.linkedin.com/company/wipro","external_url":null,"deleted":0,"application_active":1,"salary":null,"applicants_count":"Be among the first 25 applicants","linkedin_job_id":3377659526,"country":"United States","last_updated_ux":1671167994,"redirected_url":"https://www.linkedin.com/jobs/view/senior-director-of-sales-bps-at-wipro-3377659526","redirected_url_hash":"2c94fd48902f72e8cd4e9fb7331faf56","job_functions_collection":[{"id":58545684,"job_id":103214576,"function_id":13349,"deleted":0,"created":"2022-12-02 18:48:24","last_updated":"2022-12-02 18:48:24","job_function_list":{"id":13349,"created":"2022-07-05 07:13:50","last_updated":"2022-07-05 07:13:50","function":"Consulting, Sales, and Business Development","hash":"41b42c07dfe0c9b5e2d1cf4ad44c5b82"}}],"job_industries_collection":[{"id":77891033,"job_id":103214576,"industry_id":8197,"deleted":0,"created":"2022-12-02 18:48:25","last_updated":"2022-12-02 18:48:25","job_industry_list":{"id":8197,"created":"2022-07-05 12:45:34","last_updated":"2022-07-05 12:45:34","industry":"IT Services and IT Consulting, Consumer Services, and Business Consulting and Services","hash":"de3c0096d54669f895eedb1fa3ed05b3"}}],"job_status_log_collection":[{"id":1440212698,"job_id":103214576,"created":"2022-12-02 18:48:24","last_updated":"2022-12-02 19:09:00","status":"active","deleted":1},{"id":1440325571,"job_id":103214576,"created":"2022-12-02 19:09:00","last_updated":"2022-12-02 19:24:47","status":"active","deleted":1},{"id":1440403609,"job_id":103214576,"created":"2022-12-02 19:24:47","last_updated":"2022-12-02 19:53:47","status":"active","deleted":1},{"id":1440546095,"job_id":103214576,"created":"2022-12-02 19:53:47","last_updated":"2022-12-16 05:19:54","status":"active","deleted":1},{"id":1492533527,"job_id":103214576,"created":"2022-12-16 05:19:54","last_updated":"2022-12-16 05:19:54","status":"active","deleted":0}]},
  {"id":103327172,"created":"2022-12-03 00:58:10","last_updated":"2022-12-16 05:47:15","time_posted":"1 week ago","title":"Head of Business Operations and Sales Growth","description":"This role may also be located in our Playa Vista, CA campus.\n\nNote: By applying to this position you will have an opportunity to share your preferred working location from the following:New York, NY, USA; Ann Arbor, MI, USA; Chicago, IL, USA; Los Angeles, CA, USA; Redwood City, CA, USA; San Francisco, CA, USA.Minimum qualifications:\n\n10 years of experience in analytics, advertising, consulting or tech\nExperience managing teams, building team culture, and cultivating talent\nExperience building hypotheses, conducting analysis, uncovering insights, and building and executing recommendations\nExperience with SQL\n\n\nPreferred qualifications:\n\nMBA or Master's degree in an analytical field, or equivalent practical experience\nKnowledge of Google’s Ads products, sales teams, and/or service operations as well as the customer and competitive contexts in which they operate\nAbility to effectively operate with flexibility in a fast-moving, constantly evolving team environment\nAbility to effectively influence, communicate, and drive change with multiple stakeholders at all levels\nExcellent communication and presentation development skills with the ability to take complex, ambiguous topics and turn them into stories that influence an audience\n\n\nAbout The Job\n\nThe Americas Revenue Strategy and Operations (RSO) Team helps build and guide the strategic focus areas of the Americas Google Customer Solutions (GCS) Sales team, with the goal of driving stronger growth and productivity. As the Head of Business Operations and Sales Growth, you will be providing thought leadership and bringing analytical insights to the Americas Google Customer Solutions VP and their staff. You will help define the strategy for the business, drive annual planning, lead partnership with other internal strategy teams and manage and develop a team of high performing analysts.\n\nWhen our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the \"human face\" of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. In collaboration, we create and implement business plans broadly for all types of businesses.\n\nThe US base salary range for this full-time position is $208,000-$312,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.\n\nPlease note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits.\n\nResponsibilities\n\nEngage in thought leadership with large analytical projects for GCS Americas guide hypotheses and analysis behind drivers and root causes, recommend and prioritize highest impact initiatives.\nOwn performance overview projects and insights for the VP of Americas GCS and their staff. Lead businesses performance and strategy projects.\nHelp define the strategy for the business, align with the central team, and land with each business unit and market in Americas.\nOwn and lead key business processes that underpin sales operations. Drive the channel management process between Large Customer Sales (LCS) and GCS. Own staffing and recruiting analytics as they pertain to coverage decisions, and prioritize and make Opex recommendations.\nManage, coach, and develop a team of high performing strategy and operations analysts, to deliver against strategic business goals and grow them professionally.\n\n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .","seniority":"Director","employment_type":"Full-time","location":"Chicago, IL","url":"https://www.linkedin.com/jobs/view/head-of-business-operations-and-sales-growth-at-google-3382864981","hash":"8ef8013ce5eddd71f5d140a5709c527f","company_id":3252082,"company_name":"Google","company_url":"https://www.linkedin.com/company/google","external_url":"https://careers.google.com/jobs/results/113133854824243910-head-of-business-operations-and-sales-growth/?src=Online/LinkedIn/linkedin_us&utm_source=linkedin&utm_medium=jobposting&utm_campaign=contract","deleted":0,"application_active":1,"salary":null,"applicants_count":"89 applicants","linkedin_job_id":3382864981,"country":"United States","last_updated_ux":1671169635,"redirected_url":"https://www.linkedin.com/jobs/view/head-of-business-operations-and-sales-growth-at-google-3382864981","redirected_url_hash":"8ef8013ce5eddd71f5d140a5709c527f","job_functions_collection":[{"id":58657202,"job_id":103327172,"function_id":15537,"deleted":0,"created":"2022-12-03 00:58:10","last_updated":"2022-12-03 00:58:10","job_function_list":{"id":15537,"created":"2022-07-05 09:34:15","last_updated":"2022-07-05 09:34:15","function":"General Business, Strategy/Planning, and Consulting","hash":"8ddc3421d52301c6cc552767a605759f"}}],"job_industries_collection":[{"id":78012891,"job_id":103327172,"industry_id":752,"deleted":0,"created":"2022-12-03 00:58:10","last_updated":"2022-12-03 00:58:10","job_industry_list":{"id":752,"created":"2022-07-05 09:31:46","last_updated":"2022-07-05 09:31:46","industry":"Information Services and Technology, Information and Internet","hash":"ccec78135ad925f08c170fd2a087eef6"}}],"job_status_log_collection":[{"id":1441617404,"job_id":103327172,"created":"2022-12-03 00:58:10","last_updated":"2022-12-03 01:07:17","status":"active","deleted":1},{"id":1441647434,"job_id":103327172,"created":"2022-12-03 01:07:16","last_updated":"2022-12-03 01:16:34","status":"active","deleted":1},{"id":1441669394,"job_id":103327172,"created":"2022-12-03 01:16:33","last_updated":"2022-12-03 01:58:45","status":"active","deleted":1},{"id":1441776862,"job_id":103327172,"created":"2022-12-03 01:58:44","last_updated":"2022-12-03 01:59:11","status":"active","deleted":1},{"id":1441778101,"job_id":103327172,"created":"2022-12-03 01:59:11","last_updated":"2022-12-03 02:01:00","status":"active","deleted":1},{"id":1441785213,"job_id":103327172,"created":"2022-12-03 02:00:59","last_updated":"2022-12-03 18:12:55","status":"active","deleted":1},{"id":1445359025,"job_id":103327172,"created":"2022-12-03 18:12:55","last_updated":"2022-12-16 05:47:15","status":"active","deleted":1},{"id":1492622053,"job_id":103327172,"created":"2022-12-16 05:47:15","last_updated":"2022-12-16 05:47:15","status":"active","deleted":0}]},
  {"id":103370240,"created":"2022-12-03 05:03:37","last_updated":"2022-12-16 05:28:24","time_posted":"1 week ago","title":"Managing Director - Head of Wealth Management Supervision","description":"About J.P. Morgan\n\nJPMorgan Chase & Co . is a leading global financial services firm with assets of more than $2.7 trillion, over 270,000 employees and operations in over 70 countries. It operates across four business segments including Asset & Wealth Management, Corporate and Investment Banking, Commercial Banking and Consumer and Community Banking.\n\nThe JPM Wealth Management (JPMWM) business is focused on helping investors achieve their long-term financial goals and is comprised of the Chase Wealth Management business, J.P. Morgan Advisors and J.P. Morgan Self-Directed Investing- our digital investing platform as well as J.P. Morgan Investments Direct and J.P. Morgan Personal Advisors - our Remote Wealth Management offering. The combined business has ~$400 billion in assets under management and ~4,000 advisors who work out of 3,500 branches and 21 offices. In addition to supporting JPM Wealth Management, the Supervisory function supports the US Private Bank, the International Private Bank, and the firm's wealth management trading desks.\n\nPosition\n\nThe Supervision Executive is a visible senior leader, responsible for leading the strategy and day-to-day decision making for a global Supervisory function supporting across US Wealth Management business, the US Private Bank, the International Private Bank, and the firm's wealth management trading desks.\n\nThe leader must have a track record of excelling in complex, cross-functional organizational models and have a demonstrated track record of effectively communicating and influencing people, progress, and outcomes across busines units. The leader must be pragmatic, have strong problem-solving and decisive decision-making skills, and be maniacally focused on people development of critical professional skills including communication, storytelling with data, influence, problem solving, and how to take thoughts through to execution.\n\nAny successful candidate truly enjoys problem solving, collaboration, people development, and driving accountability, continuous process improvement, and scale-based thinking.\n\nResponsibilities\n\nOversee the firm's Supervisory Framework and ongoing enhancements to its models supporting the US Wealth Management business, the US Private Bank, the International Private Bank, and the firm's wealth management trading desks.\nLead a large scale, global organization and develop people strategies, build culture and design an organization to align with business growth.\nDrive enhancement and implementation of automated solutions for the supervisory team to better perform their delegated supervisory duties with consistency across a large scale, global team of registered principals.\nKey driver for high priority initiatives working across multiple stakeholders and various business functions and with a high level of organizational impact.\nBuilds trust and rapport through all interactions to deliver the right outcomes for the business\nResponsible for the oversight and ongoing training of supervisory principals and additional staff.\nDevelopment and implementation of a dynamic product and account risk ranking model used to identify potential unsuitable transactions and sales practice concerns.\nAccountable for the supervisory review of communications with the public.\nMaintain and continue to enhance the firm's Supervisory Framework through automation and the use of Artificial Intelligence and Machine Learning.\nEstablish Sales Practice and Book Reviews focused on risks identified through the review of patterns and trends.\nResponsible for oversight and maintenance of risk metrics to assess the overall health of the business.\nResponsible for managing disciplinary forums with escalation and reporting to various internal committees.\nPresent on a regular basis to senior executives and stakeholders on business and organizational initiatives\nSenior stakeholder across critical governance forums including the firm's Business Conduct Committee, Risk Committee, Advisor Compensation Committee, Investment Product Committee and the bank's Retail Non-Deposit Investment Products (RNDIP) Committee.\nCoordination of Audit and Compliance reviews relating to the Supervisory Framework.\nEngage with Regulators on behalf of Supervision and the Firm.\n\n\nQualifications\n\nSenior leader with 15+ years of proven experience leading a Supervisory, Risk or Compliance based function and coaching and managing people, projects, and process, in a wealth or investment focused environment\nStrong, proven leadership skills across large scale, matrixed organizations\nStrong track record of building and retaining high performing teams\nStrategic thinker with a with solution-focused mindset\nAbility to drive results, lead with tenacity and influence outcomes\nAbility to manage multiple priorities in a fast- paced environment; adaptive to change\nStrong communications abilities calibrated to a variety of audiences (team, business partners, regulators)\nStrong data fluency skills, leveraging data for decisioning and informing\nDeep understanding of brokerage, advisory, complex and insurance products\nDeep understanding of both FINRA and SEC regulations with an ability to practically apply them to the firm's overall Supervisory Framework\nWorking knowledge and practical application of anomaly detection and machine learning\nWorking understanding of local regulations within international jurisdictions\nUnderstanding of capital markets and trading desk requirements\nExperience engaging with Regulators relating to the firm's Supervisory Framework\nAbility to effectively partner with business representatives and the firm's Control, Risk, Compliance and Legal organizations\nStrong attention to detail, highly organized with excellent follow-through and accountability\nBachelor's degree required\nAbility to travel ~25% of the time, including international travel as needed\n\n\n Required Registrations  : 7, 9/10, 24\n\nChase is a leading financial services firm, helping nearly half of America's households and small businesses achieve their financial goals through a broad range of financial products. Our mission is to create engaged, lifelong relationships and put our customers at the heart of everything we do. We also help small businesses, nonprofits and cities grow, delivering solutions to solve all their financial needs.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants' and employees' religious practices and beliefs, as well as any mental health or physical disability needs.\n\nThe health and safety of our colleagues, candidates, clients and communities has been a top priority in light of the COVID-19 pandemic. JPMorgan Chase was awarded the \"WELL Health-Safety Rating\" for all of our 6,200 locations globally based on our operational policies, maintenance protocols, stakeholder engagement and emergency plans to address a post-COVID-19 environment.\n\nAs a part of our commitment to health and safety, we have implemented various COVID-related health and safety requirements for our workforce. Employees are expected to follow the Firm's current COVID-19 or other infectious disease health and safety requirements, including local requirements. Requirements include sharing information including your vaccine card in the firm's vaccine record tool, and may include mask wearing. Requirements may change in the future with the evolving public health landscape. JPMorgan Chase will consider accommodation requests as required by applicable law.\n\nWe offer a competitive total rewards package including base salary determined based on the role, experience, skill set, and location. For those in eligible roles, discretionary incentive compensation which may be awarded in recognition of individual achievements and contributions. We also offer a range of benefits and programs to meet employee needs, based on eligibility. These benefits include comprehensive health care coverage, on-site health and wellness centers, a retirement savings plan, backup childcare, tuition reimbursement, mental health support, financial coaching and more. Additional details about total compensation and benefits will be provided during the hiring process.\n\nEqual Opportunity Employer/Disability/Veterans\n\nBase Pay/Salary\n\nNew York,NY $300,000.00 - $500,000.00 / year","seniority":"Director","employment_type":"Full-time","location":"New York, NY","url":"https://www.linkedin.com/jobs/view/managing-director-head-of-wealth-management-supervision-at-jpmorgan-chase-co-3383550785","hash":"511389550962f57cb38775d2ccd9a40f","company_id":8172788,"company_name":"JPMorgan Chase & Co.","company_url":"https://www.linkedin.com/company/jpmorganchase","external_url":"https://ars2.equest.com/?response_id=e47d2efaf4c547c4be16e748be9e946c","deleted":0,"application_active":1,"salary":null,"applicants_count":"Be among the first 25 applicants","linkedin_job_id":3383550785,"country":"United States","last_updated_ux":1671168504,"redirected_url":"https://www.linkedin.com/jobs/view/managing-director-head-of-wealth-management-supervision-at-jpmorgan-chase-co-3383550785","redirected_url_hash":"511389550962f57cb38775d2ccd9a40f","job_functions_collection":[{"id":58701725,"job_id":103370240,"function_id":12186,"deleted":0,"created":"2022-12-03 05:03:37","last_updated":"2022-12-03 05:03:37","job_function_list":{"id":12186,"created":"2022-07-05 06:45:34","last_updated":"2022-07-05 06:45:34","function":"Business Development and Sales","hash":"c888bb3db05af11125b17ce50715ede3"}}],"job_industries_collection":[{"id":78064279,"job_id":103370240,"industry_id":39,"deleted":1,"created":"2022-12-03 05:03:37","last_updated":"2022-12-03 05:03:37","job_industry_list":{"id":39,"created":"2020-08-14 14:11:49","last_updated":"2020-08-14 14:11:49","industry":"Capital Markets","hash":"98bf4640b315d6320d944b36f9ea06e7"}},{"id":82385767,"job_id":103370240,"industry_id":1,"deleted":0,"created":"2022-12-16 05:28:23","last_updated":"2022-12-16 05:28:23","job_industry_list":{"id":1,"created":"2020-08-14 14:11:37","last_updated":"2020-08-14 14:11:37","industry":"Financial Services","hash":"f279b250fb9ccc9ae5a43849e8f6fd4c"}}],"job_status_log_collection":[{"id":1442222844,"job_id":103370240,"created":"2022-12-03 05:03:37","last_updated":"2022-12-03 19:43:33","status":"active","deleted":1},{"id":1445749757,"job_id":103370240,"created":"2022-12-03 19:43:33","last_updated":"2022-12-16 05:28:24","status":"active","deleted":1},{"id":1492555317,"job_id":103370240,"created":"2022-12-16 05:28:23","last_updated":"2022-12-16 05:28:24","status":"active","deleted":0}]},
  {"id":103991846,"created":"2022-12-05 21:44:41","last_updated":"2022-12-05 22:46:19","time_posted":"1 hour ago","title":"Senior Director - US Federal Operations","description":"As the dedicated Operations team for Microsoft Federal, our organization is mission-focused and supports field and partner engagement, revenue processing, and the Deploy, Transact, Protect and Optimize phases of our operating model for Federal customers and partners, including BPO transaction services, incentives operations, and compliance.\n\nOur organizationempowers our customers and partners through rapidly adapted launch, channel, contracting, invoicing, and fulfillment processes enabled by best-in-class capabilities, enhanced engagement models, and resources.\n\nWe are currently looking to add aSenior Director of US Federal Operations to the team. In this role, you will serve as a trusted leader to the Americas Operations General Manager. You will lead and oversee US Federal Operations organization including strategy and execution supporting order to cash processes, partner incentives and subcontractor payments for Microsoft products and services sold to the US Government. Along with building and nurturing a high performing team, you will also be responsible for leveraging operational processes and working across the company to ensure the management of compliant and secure transactions. Additionally, you will bring operational excellence to the design, maturity, performance of our operational metrics and driving continuous improvement and innovation to delivery industry leading experiences.\n\nResponsibilities\nLead and grow a diverse and strong leadership team to foster a culture of compliance, execution, accountability, inclusion, collaboration, and process excellence.\nShape the vision and strategy for US Federal Operations including strategic choices for execution supporting order to cash processes and incentives.\nDrive strategic transformation initiatives, including proactively identifying and solving roadblocks in the process, to get ahead of changes in our business.\nShape performance goals and drive day-to-day excellence in execution to identify opportunities to maximize effectiveness, efficiency, and compliance.\nDrive continuous improvement to address process, tooling challenges based on prioritized feedback from stakeholders.\nResponsible for cost management, driving efficiency, effectiveness, and requirements/prioritization of workloads for automation.\nLead resourcing decisions as new work signals drive demand into execution, carefully balancing capacity across the team with MS priorities.\nLeverage processes for core operating charter from Microsoft Business Operations and modify to best meet the needs of government fulfillment requirements.\nEngage executive subsidiary stakeholders to cultivate a trusted partnership with Microsoft Business Operations to effectively meet the needs of our government customers.\nBuild and manage strong relationships with cross company business groups to facilitate information sharing that ensures informed business prioritization and decision making.\nDrive articulate messaging and communications across all levels of the organization to drive awareness, understanding and alignment on plans, roadmaps and implications.\n\nQualifications\n\nBasic Qualifications:\nBachelor's Degree in Business, Operations, Finance or related field AND 8+ years work experience in program management, process management, process improvement OR equivalent experience.\n6+ years management (e.g., people, project, process, vendor, change) experience.\n\n\nDetailed years of leadership experience in process and people management for order to cash capabilities including focus on invoicing, partner incentives, and other integrated processes. Preference for candidate with supply chain operations background and skills.\nExperienced in strategic planning, change management and execution supporting sales operations\nExcellence in thought leadership, decision-making, influence and process execution management\nPossess deep understanding of Commercial Product and Services portfolio. Go To Market motions and execution systems and platforms\nA track record of exceptional partnering across a wide array of internal business groups, executive stakeholders and execution partners with ability to build solid relationships with individuals at all levels\nAbility to navigate across teams via influence and collaboration to get things done\nAn excellent people leader, capable of motivating and creating active followership and virtual teams to accelerate the Operations strategy and customer impact\nPassion for our customers, technology, and people\n\nSecurity Requirement\n\nThis position requires verification of US Citizenship to meet federal government security requirements.\n\nUS Security Clearance Requirements: Candidates must be able to meet Microsoft, customer and/or government security screening requirements required for this role. These requirements include, but are not limited to the following specialized security screenings:  \nCitizenship Verification: This position requires verification of US Citizenship to meet federal government security requirements.\nCandidates must have an active TS and be willing to upgrade to TS/SCI (with polygraph) or have an active TS/SCI and be willing to upgrade to TS/SCI (with polygraph). This role will require candidates to maintain the TS/SCI (with polygraph) clearance.\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\n\nAdditional Or Preferred QualificationsBachelor's Degree in Business, Operations, Finance or related field AND 12+ years experience in program management , process management, process improvement\nOR Master's Degree in Business, Operations, Finance or related field AND 10+ years program management experience, process management, process improvement\nOR equivalent experience.\n8+ years people management experience.\n\nThe typical base pay range for this role across the U.S. is USD $124,800 - $266,800 per year.\n\nMicrosoft has different base pay ranges for different work locations within the United States, which allows us to pay employees competitively and consistently in different geographic markets (see below). The range above reflects the potential base pay across the U.S. for this role (except as noted below); the applicable base pay range will depend on what ultimately is determined to be the candidate’s primary work location. Individual base pay depends on various factors, in addition to primary work location, such as complexity and responsibility of role, job duties/requirements, and relevant experience and skills. Base pay ranges are reviewed and typically updated each year. Offers are made within the base pay range applicable at the time.\n\nAt Microsoft certain roles are eligible for additional rewards, including merit increases, annual bonus and stock. These awards are allocated based on individual performance. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee’s role. Benefits/perks listed here may vary depending on the nature of employment with Microsoft and the country work location. U.S.-based employees have access to healthcare benefits, a 401(k) plan and company match, short-term and long-term disability coverage, basic life insurance, and wellbeing benefits, among others.\n\nThere is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $159,000 - $292,200 per year.\n\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.\n\nBenefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.","seniority":"Director","employment_type":"Full-time","location":"Reston, VA","url":"https://www.linkedin.com/jobs/view/senior-director-us-federal-operations-at-microsoft-3386272546","hash":"7b00582053165694e17f1d5007dbe7ba","company_id":5181133,"company_name":"Microsoft","company_url":"https://www.linkedin.com/company/microsoft","external_url":"https://careers.microsoft.com/us/en/job/1490980/Senior-Director-US-Federal-Operations?jobsource=linkedin&utm_source=linkedin&utm_medium=linkedin&utm_campaign=linkedin-feed","deleted":0,"application_active":1,"salary":null,"applicants_count":"Be among the first 25 applicants","linkedin_job_id":3386272546,"country":"United States","last_updated_ux":1670280379,"redirected_url":"https://www.linkedin.com/jobs/view/senior-director-us-federal-operations-at-microsoft-3386272546","redirected_url_hash":"7b00582053165694e17f1d5007dbe7ba","job_functions_collection":[{"id":59287217,"job_id":103991846,"function_id":6,"deleted":0,"created":"2022-12-05 21:44:41","last_updated":"2022-12-05 21:44:41","job_function_list":{"id":6,"created":"2020-08-14 14:11:38","last_updated":"2020-08-14 14:11:38","function":"Other","hash":"6311ae17c1ee52b36e68aaf4ad066387"}}],"job_industries_collection":[{"id":78706490,"job_id":103991846,"industry_id":729,"deleted":0,"created":"2022-12-05 21:44:41","last_updated":"2022-12-05 21:44:41","job_industry_list":{"id":729,"created":"2022-07-05 09:31:42","last_updated":"2022-07-05 09:31:42","industry":"IT Services and IT Consulting, Computer Hardware Manufacturing, and Software Development","hash":"842cfe6e8fa854df1a90bc1fdcb6274e"}}],"job_status_log_collection":[{"id":1454838580,"job_id":103991846,"created":"2022-12-05 21:44:41","last_updated":"2022-12-05 22:26:12","status":"active","deleted":1},{"id":1455026625,"job_id":103991846,"created":"2022-12-05 22:26:12","last_updated":"2022-12-05 22:33:20","status":"active","deleted":1},{"id":1455058815,"job_id":103991846,"created":"2022-12-05 22:33:20","last_updated":"2022-12-05 22:46:19","status":"active","deleted":1},{"id":1455123080,"job_id":103991846,"created":"2022-12-05 22:46:19","last_updated":"2022-12-05 22:46:19","status":"active","deleted":0}]},
  {"id":104179611,"created":"2022-12-06 12:40:27","last_updated":"2022-12-06 12:40:27","time_posted":"45 minutes ago","title":"Senior Principal, Business Trends Analysis, Customer Experience & Business Trends","description":"Description\n\nThe Customer Experience & Business Trends (CXBT) organization made up of various functions that are dedicated to improving the customer experience for all existing and future customers of Amazon’s diverse businesses, globally. We build products and solutions that help us evaluate trends and opportunities, and work with teams all over the world to influence existing products and services, as well as those that are not yet launched. We are searching for an experienced, talented, and customer obsessed senior leader to come join our fast-growing and exciting global team as Principal, Customer Experience & Business Trends. In this role, you will be responsible for identifying and delivering emerging customer experience insights, partnering with senior business and technical leaders across the company, building high visibility inspection mechanisms, and ensuring Amazon is providing the best possible customer experience.\n\nThe successful leader will have a strong track record of looking around corners, delivering solid analysis and making real world impact. In this role, you will design roadmap and deliver insights that influence strategic decisions around the world, and engage with senior leaders worldwide (with a focus in APAC) to align on priorities. You will excel at earning trust from our most senior leaders, communicating multi-faceted findings clearly, and using data and sound business judgment to drive and influence strategic decisions.\n\nYou will work with a team in Asia and the US, and be effective in understanding business, technology, and customer needs. You will experiment with, build, and implement innovative approaches to generate new insights. You will work cross-functionally and will share and drive best practices across the broader organization as part of the CXBT senior leadership team. You will set a bold direction and be accountable to deliver, and contribute to a high-performing culture.\n\nKey job responsibilities\nSurface key emerging customer trends that Amazon should be thinking about now to better serve our customers.\nBuild strong relationships with senior leaders and other key stakeholders, enabling your team to effectively engage across all of our diverse businesses (e.g., AWS, Consumer, Advertising, Alexa, Games)\nChampion bold ideas on how to evolve and grow the analytical capabilities and mechanism.\nPartner with internal tech and business team to refine and iterate on ideas, influencing strategic plans.\nDrive and influence key business decisions across the company on regular basis.\nPartner with external entities to drive projects forward\nEstablish mechanisms to inspect, report, and inspire on customer experience improvements across Amazon.\n\n\nBasic Qualifications\nBachelor’s degree in Business, Economics, Marketing, Psychology or a related field is required\n12+ years of experience in positions that require strategic thinking and driving insights, analysis, and interpretation of data to deliver business impact and results\n\nPreferred Qualifications\nIn-depth understanding for the customers trends in APAC across various industries, especially China\nTrack record of superior business acumen and analytical skills.\nSuperior verbal and written communication skills with an innate attention to data and details\nExperience in Investments, economics, or growth technology companies\nExperience working with senior leadership as well as ability to influence and advise\nExperience working in a fast-paced and highly cross-functional organization\nAbility to manage time and juggle multiple priorities to execute high quality deliverables\nTech background is preferred, e.g. cloud computing, AI, Machine learning, etc.\n\n\nCompany - Amazon Asia-Pacific Holdings\n\nJob ID: A2306309","seniority":"Director","employment_type":"Full-time","location":"Singapore, Singapore","url":"https://www.linkedin.com/jobs/view/senior-principal-business-trends-analysis-customer-experience-business-trends-at-amazon-3379144117","hash":"d1e904fefd1a1640b1ed07618a216d47","company_id":8579547,"company_name":"Amazon","company_url":"https://www.linkedin.com/company/amazon","external_url":"https://www.amazon.jobs/jobs/2306309/senior-principal-business-trends-analysis-customer-experience--business-trends?cmpid=SPLICX0248M&utm_source=linkedin.com&utm_campaign=cxro&utm_medium=social_media&utm_content=job_posting&ss=paid","deleted":0,"application_active":1,"salary":null,"applicants_count":"Be among the first 25 applicants","linkedin_job_id":3379144117,"country":"Singapore","last_updated_ux":1670330427,"redirected_url":"https://www.linkedin.com/jobs/view/senior-principal-business-trends-analysis-customer-experience-business-trends-at-amazon-3379144117","redirected_url_hash":"d1e904fefd1a1640b1ed07618a216d47","job_functions_collection":[{"id":59459527,"job_id":104179611,"function_id":12315,"deleted":0,"created":"2022-12-06 12:40:27","last_updated":"2022-12-06 12:40:27","job_function_list":{"id":12315,"created":"2022-07-05 06:47:19","last_updated":"2022-07-05 06:47:19","function":"Project Management, Management, and Product Management","hash":"ca1663f802c93cb7c7aaf2a291b9738a"}}],"job_industries_collection":[{"id":78897058,"job_id":104179611,"industry_id":517,"deleted":0,"created":"2022-12-06 12:40:27","last_updated":"2022-12-06 12:40:27","job_industry_list":{"id":517,"created":"2022-07-05 08:25:38","last_updated":"2022-07-05 08:25:38","industry":"IT Services and IT Consulting, Software Development, and Technology, Information and Internet","hash":"f07722e5a4ca643c16f42ab01baff634"}}],"job_status_log_collection":[{"id":1457539421,"job_id":104179611,"created":"2022-12-06 12:40:27","last_updated":"2022-12-06 12:40:27","status":"active","deleted":0}]},
  {"id":104274643,"created":"2022-12-06 18:31:29","last_updated":"2022-12-06 18:31:30","time_posted":"34 minutes ago","title":"Principal Applied Scientist - Machine Learning, SCOT - Fulfillment By Amazon","description":"Job Summary\n\nDESCRIPTION\n\nSCOT-FBA team is looking for a passionate, curious, and creative Principal Applied Scientist who is an applied machine learning expert with a proven record of solving customer-facing problems through scalable ML solutions to join our top-notch cross-domain science team. We want to learn FBA Seller behaviors, understand Seller experience through internal and external data, design best policies and incentives, and develop science products and services to help Sellers to improve their inventory efficiency and long-term value from both Amazon’s and sellers’ perspectives by using innovative and scalable science solutions based on interdisciplinary research of operations research, machine learning, market design, causal analysis, and data analytics. As a principal applied scientist, you will work on various science projects that draw from a range of fields such as supervised and unsupervised learning, recommendation systems, advanced statistical modeling, NLP, transfer learning, causal analysis, reinforcement learning and others on large datasets. The role has high visibility to senior Amazon business leaders and involves working with other scientists, and partnering with engineering and product teams to integrate these models into production systems.\n\nAbout The Team\n\nSupply Chain Optimization Technologies (SCOT) optimizes Amazon’s global supply chain end to end and build systems to deliver billions of products to our customers’ doorsteps faster every year while saving hundreds of millions of dollars using science, machine learning, and scalable distributed software on the Cloud. FBA is an Amazon service for our marketplace third party sellers, where our sellers leverage our world-class facilities and provide customers Prime delivery promise on all their goods. In last few years, Sellers enjoyed strong growth using FBA shipping more than half of all products offered on Amazon. SCOT has launched a new team called Fulfillment by Amazon (FBA) to focus on automating and optimizing our third-party supply chain. The new organization is in charge of defining and delivering fulfillment services to our Sellers by leveraging Amazon’s expertise in machine learning, inventory optimization, big data, and distributed systems to deliver the best inventory management experiences for our FBA Sellers. We work full stack, from foundational backend systems to future-forward user interfaces. Our culture is centered on rapid prototyping, rigorous experimentation, and data-driven decision-making. We work full stack, from foundational backend systems to future-forward user interfaces. Our culture is centered on rapid prototyping, rigorous experimentation, and data-driven decision-making.\n\n\nBasic Qualifications\nPh.D. in Machine Learning, Statistics, Applied Mathematics, Computer Science or a related field with publications in refereed academic journals.\n7+ years of experience in solving complicated machine learning problems.\nSolid Machine Learning background and familiar with standard machine learning and statistical learning techniques.\nHands-on experience using Java, C++, or other programming language, as well as with R, Python or similar scripting language.\nDemonstrated ability to serve as a technical lead\nExcellent communication skills, both written and oral with both technical and business people.\nExcellent writing skills for presenting business cases and to document the models and analysis and present the results/conclusions in order to influence important decisions.\n\nPreferred Qualifications\nDeep knowledge of probabilistic machine learning\nExperience with deep learning toolkits and frameworks\nExpert in more than one more major programming languages (C++, Java, or similar) and at least one scripting language (Perl, Python, or similar)\nSolid software development experience\nAlgorithm and model development experience for large-scale applications\nStrong fundamentals in problem solving, algorithm design and complexity analysis\nStrong personal interest in learning, researching, and creating new technologies with high customer impact\nExperience with defining research and development practices in an applied environment\nProfessional traits that are not unique to this position, but necessary for Amazon leaders: Exhibits excellent judgment; Has relentlessly high standards; Thinks strategically, but stays on top of tactical execution; Expects and requires innovation of her/his team; Thinks big and has convictions; Results oriented; Has the innate ability to inspire passion in others\n\nAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.\n\n\nCompany - Amazon.com Services LLC\n\nJob ID: A1920583","seniority":"Director","employment_type":"Full-time","location":"United States","url":"https://www.linkedin.com/jobs/view/principal-applied-scientist-machine-learning-scot-fulfillment-by-amazon-at-amazon-3379810761","hash":"60a1bd45fae74060b274ca65268aa07f","company_id":8579547,"company_name":"Amazon","company_url":"https://www.linkedin.com/company/amazon","external_url":"https://www.amazon.jobs/jobs/1920583/principal-applied-scientist--machine-learning-scot--fulfillment-by-amazon?cmpid=SPLICX0248M&utm_source=linkedin.com&utm_campaign=cxro&utm_medium=social_media&utm_content=job_posting&ss=paid","deleted":0,"application_active":1,"salary":null,"applicants_count":"Be among the first 25 applicants","linkedin_job_id":3379810761,"country":"United States","last_updated_ux":1670351490,"redirected_url":"https://www.linkedin.com/jobs/view/principal-applied-scientist-machine-learning-scot-fulfillment-by-amazon-at-amazon-3379810761","redirected_url_hash":"60a1bd45fae74060b274ca65268aa07f","job_functions_collection":[{"id":59540897,"job_id":104274643,"function_id":12288,"deleted":0,"created":"2022-12-06 18:31:29","last_updated":"2022-12-06 18:31:29","job_function_list":{"id":12288,"created":"2022-07-05 06:46:56","last_updated":"2022-07-05 06:46:56","function":"Research, Science, and Engineering","hash":"143db377f09552728b8567e6c4266615"}}],"job_industries_collection":[{"id":78982739,"job_id":104274643,"industry_id":517,"deleted":0,"created":"2022-12-06 18:31:29","last_updated":"2022-12-06 18:31:29","job_industry_list":{"id":517,"created":"2022-07-05 08:25:38","last_updated":"2022-07-05 08:25:38","industry":"IT Services and IT Consulting, Software Development, and Technology, Information and Internet","hash":"f07722e5a4ca643c16f42ab01baff634"}}],"job_status_log_collection":[{"id":1458866986,"job_id":104274643,"created":"2022-12-06 18:31:29","last_updated":"2022-12-06 18:31:30","status":"active","deleted":0}]},
  {"id":104431527,"created":"2022-12-07 05:12:00","last_updated":"2022-12-07 06:21:02","time_posted":"44 minutes ago","title":"Director, Security","description":"Position Summary...\n\nWhat you'll do...\n\nThe role of Director, Global Security Operations, International Support is to serve as a subject matter expert on all facets of security, especially focused internationally. The following provides a brief description of the position functions.\n\nCheck intelligence tools daily for developing areas of concern to the business, areas include, but not limited to political/civil unrest, increased criminal activity, seismic activity, extreme weather, health risks, and accidents that rise to the level of business impacts\nDevelop and administer the Global Security Program policy and supporting tools; including new standards formulation and helping international markets assess the maturity of their programs against the standards\nIdentify and proliferate tools to help the markets advance their security program; develop a central repository to house the tools, which serves like a library of professional resources; update the tools and the site at which they are maintained\nDevelop and refine processes to assess risk, identify mitigation measures or resources and help execute the implementation\nServe as the Business Continuity coordinator for International Support Team, ensuing plans are updated, business function leaders participate in exercises, and developed and maintain the crisis management plan\nHelp define and implement the security requirements for newly established international offices\nRoutinely liaise with Diplomatic Security, FBI, OSAC and U.S. Embassy RSOs and Legal Attaches as well as benchmark with external company security teams\nProvide regional global security leaders training on tools such as ESRI, OSAC reports, and intelligence interpretation\nUse a background of experience in all facets of security to bring value add to other parts of Global Security\n\n\nLive our Values\n\nCulture Champion\n\nModels the Walmart values to foster our culture; holds oneself and others accountable; and supports Walmart's commitment to communities, social justice, corporate social responsibility, and sustainability; maintains and promotes the highest standards of integrity, ethics and compliance.\n\n\nServant Leadership\n\nActs as an altruistic servant leader and is consistently humble, self-aware, honest, and transparent\n\n\nEmbrace Change\n\nCuriosity & Courage\n\nDemonstrates curiosity and a growth mindset; fosters an environment that supports learning, innovation, and intelligent risk-taking; and exhibits resilience in the face of setbacks.\n\n\nDigital Transformation & Change\n\nDrives continuous improvements, supervises the adoption of new technology, and supports digital disruption in line with Walmart's business model.\n\n\nDeliver for the Customer\n\nCustomer Focus\n\nDelivers expected business results while putting the customer first and consistently applying an omni-merchant mindset and the EDLP and EDLC business models to all plans and initiatives.\n\n\nStrategic Thinking\n\nAdopts a holistic perspective that considers data, analytics, customer insights, and different parts of the business when making plans and implementing strategies.\n\n\nFocus on our Associates\n\nDiversity, Equity & Inclusion\n\nSupports strategies and drives initiatives that attract and retain diverse and inclusive talent; builds high-performing teams; embraces diversity in all its forms; and actively supports diversity goal programs.\n\n\nCollaboration & Influence\n\nBuilds strong and trusting relationships with team members and business partners; works collaboratively and cross-functionally to achieve objectives; and communicates with energy and positivity to motivate, influence, and inspire commitment and action.\n\n\nTalent Management\n\nCreates a discipline and focus around developing talent, builds the talent pipeline, fosters an environment allowing everyone to bring their best selves to work, empowers associates and partners to act in the best interest of the customer and company, and regularly recognizes others' contributions and accomplishments.\n\n\nMinimum Qualifications...\n\nOutlined below are the required minimum qualifications for this position. If none are listed, there are no minimum qualifications.\n\nMinimum Qualifications: Bachelor's degree in Human Resources, Law, Risk Management, or related field and 5 years' experience in security, emergency management, risk management, law enforcement, fire service, or related area OR 7 years' experience in security, emergency management, risk management, law enforcement, fire service, or related area. 1 year's supervisory experience.\n\nPreferred Qualifications...\n\nOutlined below are the optional preferred qualifications for this position. If none are listed, there are no preferred qualifications.\n\nEmergency Management, Project Management\n\nMasters: Business Administration\n\nPrimary Location...\n\n702 SW 8TH ST, BENTONVILLE, AR 72716, United States of America","seniority":"Director","employment_type":"Full-time","location":"Bentonville, AR","url":"https://www.linkedin.com/jobs/view/director-security-at-walmart-3390600273","hash":"dfefc24cc53c8647339b320f9512b482","company_id":9863935,"company_name":"Walmart","company_url":"https://www.linkedin.com/company/walmart","external_url":"https://click.appcast.io/track/fsad84n-org?cs=4c&jg=1yfx&bid=lUf2CslKyPxm6i440ZgUYA==","deleted":0,"application_active":1,"salary":null,"applicants_count":"Be among the first 25 applicants","linkedin_job_id":3390600273,"country":"United States","last_updated_ux":1670394062,"redirected_url":"https://www.linkedin.com/jobs/view/director-security-at-walmart-3390600273","redirected_url_hash":"dfefc24cc53c8647339b320f9512b482","job_functions_collection":[{"id":59687363,"job_id":104431527,"function_id":12198,"deleted":0,"created":"2022-12-07 05:12:00","last_updated":"2022-12-07 05:12:00","job_function_list":{"id":12198,"created":"2022-07-05 06:45:50","last_updated":"2022-07-05 06:45:50","function":"Other, Information Technology, and Management","hash":"05844189a1df49e6ba54a075955d70b4"}}],"job_industries_collection":[{"id":79140128,"job_id":104431527,"industry_id":430,"deleted":0,"created":"2022-12-07 05:12:00","last_updated":"2022-12-07 05:12:00","job_industry_list":{"id":430,"created":"2022-06-22 07:32:48","last_updated":"2022-06-22 07:32:48","industry":"Retail Apparel and Fashion","hash":"099282e868da58f9734c093c5a013b94"}}],"job_status_log_collection":[{"id":1459737387,"job_id":104431527,"created":"2022-12-07 05:12:00","last_updated":"2022-12-07 05:27:52","status":"active","deleted":1},{"id":1459754645,"job_id":104431527,"created":"2022-12-07 05:27:51","last_updated":"2022-12-07 06:15:11","status":"active","deleted":1},{"id":1459821848,"job_id":104431527,"created":"2022-12-07 06:15:10","last_updated":"2022-12-07 06:21:02","status":"active","deleted":1},{"id":1459827464,"job_id":104431527,"created":"2022-12-07 06:21:02","last_updated":"2022-12-07 06:21:02","status":"active","deleted":0}]},
  {"id":104583505,"created":"2022-12-07 16:19:34","last_updated":"2022-12-07 16:19:35","time_posted":"1 hour ago","title":"Directeur de comptes stratégiques-Produits Éléctriques","description":"Changez l’avenir avec nous\n\nNos experts en vente sont les yeux et les oreilles de nos clients. Ils n’attendent pas; ils prennent des initiatives. Ils transforment les « Cela semble intéressant! » en de réels contrats ouvrant la voie à de nouvelles avenues commerciales. Rejoignez notre équipe, et nous vous donnerons l’information la plus à jour et l’indépendance dont vous avez besoin pour agir et prendre des décisions de façon autonome, ce qui vous aidera à devenir un partenaire de confiance dans le cadre des relations avec la clientèle.\n\nPourquoi vous aimerez travailler pour Siemens?\n\nLiberté et conciliation travail-famille : adoptez notre environnement de travail souple et bénéficiez d’un horaire flexible, du télétravail et d’espaces de travail numériques\nRésolution de problèmes parmi les plus importants à l’échelle mondiale : prenez part à des projets passionnants et novateurs\nEnvironnement mobilisateur et stimulant qui évolue rapidement et comprend une technologie de fine pointe\nOccasions de faire progresser votre carrière et de bénéficier de programmes de mentorat à l’échelle locale et mondiale\nRémunération globale concurrentielle\nParticipation aux bénéfices possible\nPossibilité d’acheter des vacances ou de vendre celles auxquelles vous avez droit, selon votre style de vie\nContribution à nos initiatives de responsabilité sociale centrées sur l’accès à l’éducation, l’accès à la technologie et le soutien aux communautés, tout en ayant une incidence positive sur la collectivité\nParticipation à nos célébrations ainsi qu’à nos événements sociaux et professionnels en dehors des lieux de travail\nOccasions de partager vos idées novatrices et d’être rémunéré pour celles-ci!\nAvantages et réductions pour les employés\nAccent mis sur la diversité et l’inclusivité\n\n\nSiemens est fière d’avoir été classée huit fois parmi les 100 meilleurs employeurs au Canada ainsi que d’avoir figuré parmi les meilleurs employeurs pour les jeunes Canadiens en 2020 et parmi les meilleurs employeurs du Grand Toronto en 2021.\n\nEn quoi consistera votre rôle?\n\nEn tant que directeur de comptes stratégiques, vous jouerez un rôle central dans la stratégie commerciale de la région.\n\nAider à cultiver des relations à long terme avec les décideurs clés appropriés\nSoutenir et participer au développement de solutions techniques sur mesure pour les comptes désignés.\nDévelopper une compréhension complète de la structure de l'organisation et des principales influences d'achat du compte attribué\nÉlaborer et mettre en œuvre des plans pour les comptes stratégiques qui dépassent les attentes en matière de rétention des revenus, de croissance, de rentabilité des comptes, de satisfaction et de fidélité des clients\nIdentifier et résoudre des problèmes plus complexes et appliquer des compétences de résolution de problèmes afin de faire face à la plupart des situations\nEffectuer des présentations client articulant la proposition de valeur des offres de services de solutions de produits\nEffectuer une gamme complète de travaux standard pour le domaine professionnel\nFournir à la direction des suggestions pour améliorer la part de marché en volume et les niveaux de prix\nPoursuivre une stratégie de compte à long terme qui maximise les profits\nParcourir le territoire pour une interaction face à face avec les clients\n\n\nCe qu’il vous faudra pour réussir\n\nDiplôme technique (préférable) ou expérience équivalente\nIdéalement 5 à 8 ans d'expérience en vente dans le marché de la distribution électrique\nTrès bonne connaissance de la langue française autant à l’oral qu’à l’écrit\nTrès bonne connaissance de la langue anglaise autant à l’oral qu’à l’écrit\nExpérience avec les outils de soumissions pour les produits de distribution électriques\nAppliquer avec succès des connaissances complexes des concepts fondamentaux, des pratiques et des procédures de distribution électrique.\nDémontrer une connaissance des organisations, des pratiques commerciales et de la résolution de problèmes\nExpérience avec CRM tel que Salesforce.com\nCapacité de réfléchir en fonction des projets différents et diversifiés ainsi que selon les procédures en place dans l’entreprise.\nCapacité à rechercher et proposer des solutions aux clients\nCompétences en leadership et en gestion de la relation client\nCapacité à fournir des conseils généraux ou à former du personnel de soutien et/ou professionnel\nPermis de conduire valide avec la possibilité de parcourir le territoire pour une interaction face à face avec les clients\n\n\nÀ propos de nous\n\nNous partageons nos idées et soutenons les personnes derrière celles-ci\n\nDepuis plus de 110 ans, Siemens Canada est synonyme d’excellence en ingénierie, d’innovation, de qualité et de fiabilité. Siemens Canada est un leader technologique qui offre des solutions complètes dans les domaines des infrastructures intelligentes et des industries numériques. Nous faisons de ce qui importe une réalité en établissant des normes par notre façon d’alimenter en électricité, d’automatiser et de numériser le monde qui nous entoure. L’ingéniosité nous stimule, et ce que nous créons ensemble vous appartient.\n\nNous avons changé les choses ensemble en recueillant 757 000 $ au profit d’œuvres de charité, en soutenant plus de 23 organismes sans but lucratif et en plantant 1 100 arbres dans nos collectivités locales. Siemens Canada compte 2 500 employés et 24 bureaux et installations partout au Canada. Joignez-vous à notre équipe d’environ 293 000 professionnels talentueux dans plus de 190 pays/régions et aidez-nous à relever les défis les plus stimulants pour bâtir un avenir prospère. Alors, qu’attendez-vous? Entamez la prochaine étape de votre carrière avec nous.\n\nPour en apprendre davantage sur Siemens Canada, veuillez visiter notre site Web au www.siemens.ca.\n\nToutes les demandes nous intéressent; toutefois, nous communiquerons seulement avec les candidat(e)s sélectionné(e)s.\n\nSecteur: Smart Infrastructure\n\nEntreprise: Siemens Canada Limited\n\nNiveau d'expérience: Expérimenté\n\nPlein temps / Temps partiel: Temps plein\n\nSiemens is committed to creating a diverse environment and is proud to be an equal opportunity employer. Upon request, Siemens Canada will provide reasonable accommodation for disabilities to support participation of candidates in all aspects of the recruitment process. All qualified applicants will receive consideration for employment.\n\nBy submitting personal information to Siemens Canada Limited or its affiliates, service providers and agents, you consent to our collection, use and disclosure of such information for the purposes described in our Privacy Code available at www.siemens.ca.\n\nSiemens s’engage à créer un environnement diversifié et est fière d’être un employeur souscrivant au principe de l’égalité d’accès à l’emploi. Sur demande, Siemens Canada prendra des mesures d’accommodement raisonnables pour les personnes handicapées, dans le but de soutenir la participation des candidats dans tous les aspects du processus de recrutement. Tous les candidats qualifiés seront pris en considération pour ce poste.\n\nEn transmettant des renseignements personnels à Siemens Canada limitée ou à ses sociétés affiliées, à ses fournisseurs de services ou à ses agents, vous nous autorisez à recueillir, à utiliser et à divulguer ces renseignements aux fins prévues dans notre Code de protection de la confidentialité, que vous pouvez consulter au www.siemens.ca.","seniority":"Director","employment_type":"Full-time","location":"Montreal, Quebec, Canada","url":"https://www.linkedin.com/jobs/view/directeur-de-comptes-strat%C3%A9giques-produits-%C3%A9l%C3%A9ctriques-at-siemens-3380488755","hash":"7b5617778cd3aafddd86fedec4a449ac","company_id":3995939,"company_name":"Siemens","company_url":"https://www.linkedin.com/company/siemens","external_url":"https://jobs.siemens.com/jobs/343173?lang=fr-fr&jobPipeline=LinkedIn%28Wrap%29&sourceType=PREMIUM_POST_SITE","deleted":0,"application_active":1,"salary":null,"applicants_count":"Be among the first 25 applicants","linkedin_job_id":3380488755,"country":"Canada","last_updated_ux":1670429975,"redirected_url":"https://www.linkedin.com/jobs/view/directeur-de-comptes-strat%C3%A9giques-produits-%C3%A9l%C3%A9ctriques-at-siemens-3380488755","redirected_url_hash":"7b5617778cd3aafddd86fedec4a449ac","job_functions_collection":[{"id":59818662,"job_id":104583505,"function_id":12254,"deleted":0,"created":"2022-12-07 16:19:34","last_updated":"2022-12-07 16:19:34","job_function_list":{"id":12254,"created":"2022-07-05 06:46:24","last_updated":"2022-07-05 06:46:24","function":"Sales, Business Development, and Product Management","hash":"94239eb3f5636a2d3ee2054862df288e"}}],"job_industries_collection":[{"id":79276799,"job_id":104583505,"industry_id":481,"deleted":0,"created":"2022-12-07 16:19:34","last_updated":"2022-12-07 16:19:34","job_industry_list":{"id":481,"created":"2022-06-23 08:15:50","last_updated":"2022-06-23 08:15:50","industry":"Appliances, Electrical, and Electronics Manufacturing","hash":"ca5a1c1ecce5e1670889bfe8e1b72db2"}}],"job_status_log_collection":[{"id":1461321212,"job_id":104583505,"created":"2022-12-07 16:19:34","last_updated":"2022-12-07 16:19:35","status":"active","deleted":0}]},
  {"id":104585790,"created":"2022-12-07 16:35:38","last_updated":"2022-12-07 17:55:34","time_posted":"1 hour ago","title":"Head of Sales Healthcare Practice","description":"Job Description\n\nInfosys is seeking aHead of Sales Healthcare Practice to own the net new sales and client acquisitions. In this role, you will contribute to every stage of sales planning and execution for a region including market and competitor analysis, crafting, reviewing and refining sales plans, account plans, target account list and sales pipeline, build and lead the sales plan and pipeline, review execution of sales plans, pipeline and account plans to supervise progress on lead identification and pursuit, qualify opportunities, mobilize the right team for proposal development and provide support in negotiations, review performance of team members and guide them on positioning and sales processes. You will also work on generating new businesses from our existing customers/accounts.\n\nAbout Infosys Healthcare\n\nAt Infosys, we understand the industry drivers of healthcare outcomes, optimized cost along evolving compliance needs well, and have aligned our services strategy to support healthcare organizations navigate their digital journey of tomorrow. While increased cost of care, industry consolidation and regulatory compliance are a few of the challenges faced by healthcare companies they are in parallel gearing up to use the Next-Gen Technologies around Automation, AI, Analytics, and digital experience. Organizations can thrust growth across the value chain through sophisticated technology-supported business strategies.\n\nHead Of Sales Healthcare Practice Responsibilities\n\nBusiness Planning - Region Level: Aggregate revenue/margin numbers from reporting Business Development Managers/Sales Managers, compare against the aspirational target of the Region and provide realistic revenue/margin numbers from \"new business\".\nSales Planning & Review: Own the sales plan- build, review, lead the sales pipeline and the Target Account List (TAL), provide sign-offs on the TAL, and conduct pipeline reviews on a monthly basis\nMarket Development: Bring in executive leadership by being present in key events/meetings/conferences as an executive representative, contribute to other means of improving value on events and supporting revenue growth outside the account\nCustomer Prospecting and Proposal Development and closures: Ensure that the sales plan appropriately addresses prospecting and lead generation through reviews. Help identify the right team for proposal development including external partners. Provide the required support like providing intelligence on competition, helping in getting the internal approvals and conducting regular reviews with an aim towards closure. Also work towards getting more business from the existing customers.\nOpportunity Identification and Qualification: Review the found opportunities/opportunity plans to qualify the opportunities; and review the pipeline regularly\nContracting and MSA: Help identify \"MSA accounts\" and help the team of Business Development Managers/Sales Managers build positioning for Infosys as a strategic partner. They will be responsible for the MSA terms and conditions\nAccount Planning and Review: Review Account plan and execution of the account plan to ensure planned growth for the Region\nPeople Management: Identify and recruit Business Development Managers/Sales Managers\nRequired Head of Sales Healthcare Practice Qualifications:\n\nBachelor’s degree or foreign equivalent required from an accredited institution. Will also consider three years of multifaceted experience in the specialty in lieu of every year of education\nUnderstanding of Global Delivery Model (offshore/outsourcing) and large deal experience\nMinimum of 15 years of relevant business development experience selling IT services\nTrack record of interacting and forming relationships with CXOs of leading organization\nHands-on experience with proposal creation and leading proposal presentation\nStrong leadership, interpersonal, communication and presentation skills\n\n\nU.S. citizenship or permanent residency required, we are not able to sponsor this position at this time\n\nPreferred Head Of Sales Healthcare Practice Qualifications\n\n10 Years of experience heading sales function for a technology based business\nExperience and understanding of the Healthcare industry\nHistory of achieving/overachieving sales targets\nExperience in S/W contract negotiations\nExperience with competitor mapping and SWAT analysis\nAbility to define specific ground-breaking solutions within abstract environments\nWell networked within the IT services industry and Healthcare vertical\nAbility to identify upcoming RFPs / deals by networking with key client team members\n\n\nAbout Us\n\nInfosys is a global leader in next-generation digital services and consulting. We enable clients in more than 50 countries to navigate their digital transformation. With over four decades of experience in leading the systems and workings of global enterprises, we authoritatively steer our clients through their digital journey. We do it by enabling the enterprise with an AI-powered core that helps prioritize the execution of change. We also empower the business with agile digital at scale to deliver outstanding levels of performance and customer delight. Our always-on learning agenda drives their continuous improvement through building and transferring digital skills, expertise, and ideas from our innovation ecosystem.\n\nVisit\n\nEOE/Racial Minority/Women/Veteran/Disabled/Sexual Orientation/Gender Identity/National Origin","seniority":"Director","employment_type":"Full-time","location":"United States","url":"https://www.linkedin.com/jobs/view/head-of-sales-healthcare-practice-at-infosys-3388321384","hash":"ca376db4bd8676cc5f36eff7fc75acd3","company_id":3588121,"company_name":"Infosys","company_url":"https://www.linkedin.com/company/infosys","external_url":"https://digitalcareers.infosys.com/global-careers/company-job/description/reqid/100929BR?Codes=LinkedIn","deleted":0,"application_active":1,"salary":null,"applicants_count":"Be among the first 25 applicants","linkedin_job_id":3388321384,"country":"United States","last_updated_ux":1670435734,"redirected_url":"https://www.linkedin.com/jobs/view/head-of-sales-healthcare-practice-at-infosys-3388321384","redirected_url_hash":"ca376db4bd8676cc5f36eff7fc75acd3","job_functions_collection":[{"id":59820505,"job_id":104585790,"function_id":12180,"deleted":1,"created":"2022-12-07 16:35:39","last_updated":"2022-12-07 16:35:39","job_function_list":{"id":12180,"created":"2022-07-05 06:45:26","last_updated":"2022-07-05 06:45:26","function":"Sales and Business Development","hash":"d08fd1f5a38bf960259fd21752590342"}}],"job_industries_collection":[{"id":79278757,"job_id":104585790,"industry_id":535,"deleted":1,"created":"2022-12-07 16:35:39","last_updated":"2022-12-07 16:35:39","job_industry_list":{"id":535,"created":"2022-07-05 09:30:59","last_updated":"2022-07-05 09:30:59","industry":"Computer Networking Products","hash":"52cfa27238ae6ae7542efa8c0424cfd0"}}],"job_status_log_collection":[{"id":1461348025,"job_id":104585790,"created":"2022-12-07 16:35:38","last_updated":"2022-12-07 16:53:59","status":"active","deleted":1},{"id":1461368240,"job_id":104585790,"created":"2022-12-07 16:53:58","last_updated":"2022-12-07 17:02:50","status":"active","deleted":1},{"id":1461382087,"job_id":104585790,"created":"2022-12-07 17:02:49","last_updated":"2022-12-07 17:05:17","status":"active","deleted":1},{"id":1461385722,"job_id":104585790,"created":"2022-12-07 17:05:16","last_updated":"2022-12-07 17:36:26","status":"active","deleted":1},{"id":1461407657,"job_id":104585790,"created":"2022-12-07 17:36:25","last_updated":"2022-12-07 17:55:34","status":"active","deleted":1},{"id":1461429361,"job_id":104585790,"created":"2022-12-07 17:55:34","last_updated":"2022-12-07 17:55:34","status":"active","deleted":0}]},
  {"id":104643615,"created":"2022-12-07 19:31:09","last_updated":"2022-12-07 19:48:18","time_posted":"56 minutes ago","title":"Senior Director, Quality Sourcing","description":"Directs the quality strategy for Sourcing (in either Food/Consumables or General Merchandising) to ensure effectiveness and efficiency, the achievement of quality goals, and the appropriate use of the most current technology, systems, processes, and talent. Uses statistically valid means to determine the greatest risks and opportunities. Supports suppliers in the identification of opportunities to improve quality for Walmart customers.\n\n\nSupports factories and sourcing teams in the delivery of Merchandising strategies and best practices. Develops and drives the implementation of standard operating procedures and industry best practices to ensure operational efficiency and effectiveness. Ensures product compliance with Walmart’s quality standards.\n\n\nEnsures samples of all products are tested by independent third-party laboratories to verify compliance with applicable regulations at the national and local levels of the retail market.\n\n\nPartners with product developers, merchants, and sourcing team partners to ensure factories are categorized by expertise and ability, providing the factory with the necessary tools.\n\n\nEnsures the overall quality and safety of Walmart private brand products by measuring, assessing, and weighing and combining supplier, factory, and product ratings against set product criteria. Responds to immediate safety concerns (for example, product withdraws/recalls). Oversees the implementation of preventive practices. Benchmarks private brand industry practices.\n\n\nProvides overall direction by analyzing business objectives and customer needs; developing, communicating, building support for, and implementing business strategies, plans, and practices; analyzing costs and forecasts and incorporating them into business plans; determining and supporting resource requirements; evaluating operational processes; measuring outcomes to ensure desired results; identifying and capitalizing on improvement opportunities; promoting a customer environment; and demonstrating adaptability and sponsoring continuous learning.\n\n\nDevelops and implements strategies to attract and maintain a highly skilled and engaged workforce by diagnosing capability gaps; recruiting, selecting, and developing talent; supporting mentorship, workforce development, and succession planning; and leveraging the capabilities of new and existing talent.\n\n\nCultivates an environment where associates respect and adhere to company standards of integrity and ethics by integrating these values into all programs and practices; developing consequences for violations or non-compliance; and supporting the Open Door Policy.\n\n\nDevelops and leverages internal and external partnerships and networks to maximize the achievement of business goals by sponsoring and leading key community outreach and involvement initiatives; engaging key stakeholders in the development, execution, and evaluation of appropriate business plans and initiatives; and supporting associate efforts in these areas.\n\n\nLive our Values: Culture Champion - Models the Walmart values to foster our culture; holds oneself and others accountable; and supports Walmart's commitment to communities, corporate social responsibility, and sustainability; maintains and promotes the highest standards of integrity, ethics and compliance.\n\n\nLive our Values: Servant Leadership - Acts as an altruistic servant leader and is consistently humble, self-aware, honest, and transparent.\n\n\nEmbrace Change: Curiosity & Courage - Demonstrates curiosity and a growth mindset; fosters an environment that supports learning, innovation, and intelligent risk-taking; and exhibits resilience in the face of setbacks.\n\n\nEmbrace Change: Digital Transformation & Change - Drives continuous improvements, supervises the adoption of new technology, and supports digital disruption in line with Walmart's business model.\n\n\nDeliver for the Customer: Customer Focus - Delivers expected business results while putting the customer first and consistently applying an omnimerchant mindset and the EDLP and EDLC business models to all plans and initiatives.\n\n\nDeliver for the Customer: Strategic Thinking - Adopts a holistic perspective that considers data, analytics, customer insights, and different parts of the business when making plans and implementing strategies.\n\n\nFocus on our Associates: Diversity, Equity & Inclusion - Supports strategies and drives initiatives that attract and retain diverse and inclusive talent; builds high-performing teams; embraces diversity in all its forms; and actively supports diversity goal programs.\n\n\nFocus on our Associates: Collaboration & Influence - Builds strong and trusting relationships with team members and business partners; works collaboratively and cross-functionally to achieve objectives; and communicates with energy and positivity to motivate, influence, and inspire commitment and action.\n\n\nFocus on our Associates: Talent Management - Creates a discipline and focus around developing talent, builds the talent pipeline, fosters an environment allowing everyone to bring their best selves to work, empowers associates and partners to act in the best interest of the customer and company, and regularly recognizes others' contributions and accomplishments.","seniority":"Director","employment_type":"Full-time","location":"Bentonville, AR","url":"https://www.linkedin.com/jobs/view/senior-director-quality-sourcing-at-walmart-3381323493","hash":"957dec9dd0fe27b24814a237d7bec23a","company_id":9863935,"company_name":"Walmart","company_url":"https://www.linkedin.com/company/walmart","external_url":null,"deleted":0,"application_active":1,"salary":null,"applicants_count":"Be among the first 25 applicants","linkedin_job_id":3381323493,"country":"United States","last_updated_ux":1670442498,"redirected_url":"https://www.linkedin.com/jobs/view/senior-director-quality-sourcing-at-walmart-3381323493","redirected_url_hash":"957dec9dd0fe27b24814a237d7bec23a","job_functions_collection":[{"id":59872644,"job_id":104643615,"function_id":15347,"deleted":0,"created":"2022-12-07 19:31:09","last_updated":"2022-12-07 19:31:09","job_function_list":{"id":15347,"created":"2022-07-05 09:23:03","last_updated":"2022-07-05 09:23:03","function":"Quality Assurance, Supply Chain, and Other","hash":"d43743af709e7593e76b6111791188b6"}}],"job_industries_collection":[{"id":79331736,"job_id":104643615,"industry_id":30,"deleted":0,"created":"2022-12-07 19:31:09","last_updated":"2022-12-07 19:31:09","job_industry_list":{"id":30,"created":"2020-08-14 14:11:45","last_updated":"2020-08-14 14:11:45","industry":"Retail","hash":"053e0bc8b9627b28e2ed8029a34b35bd"}}],"job_status_log_collection":[{"id":1461508353,"job_id":104643615,"created":"2022-12-07 19:31:09","last_updated":"2022-12-07 19:39:34","status":"active","deleted":1},{"id":1461512483,"job_id":104643615,"created":"2022-12-07 19:39:34","last_updated":"2022-12-07 19:46:55","status":"active","deleted":1},{"id":1461519219,"job_id":104643615,"created":"2022-12-07 19:46:55","last_updated":"2022-12-07 19:48:18","status":"active","deleted":1},{"id":1461520505,"job_id":104643615,"created":"2022-12-07 19:48:18","last_updated":"2022-12-07 19:48:18","status":"active","deleted":0}]},
  {"id":104767150,"created":"2022-12-08 04:20:34","last_updated":"2022-12-08 04:20:35","time_posted":"1 hour ago","title":"Supply Chain Execution Director - Canada","description":"In alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day. Microsoft Cloud Operations and Innovation (CO+I) is the team behind the cloud. We are responsible for delivering over 200 Microsoft web portals, Live and Online Services around the world including infrastructure, security and compliance, operations, globalization, and manageability. Our focus is on smart growth, high efficiency, and delivering a trusted experience to customers and partners worldwide. We are looking for a passionate, high energy individual to help build the network that powers the world’s largest online services.\n\nWithin CO+I, the Global Supply Chain team is responsible for establishing a supply chain that can meet the ever-growing growth of the Cloud and our customers. We support a portfolio of complex, multi-disciplinary, multi-billion, multi-year datacenter construction and lease projects. Furthermore, we support the Operations team that manages and runs the cloud assets. We are looking to fill the critical role of Special Project Contracts Manager on our Supply Chain team.\n\nThis position can be remote but would ideally be serviced from Toronto or Quebec. This role will report to MSFT’s Regional Supply Chain Director.\n\nResponsibilities\n\nResponsibilities:\nLead supply chain execution representative for Microsoft CO+I in Canada. Responsible for the procurement of all services (general contractor, consultants, design firms, etc.) as well as long lead equipment for multiple data center builds in the Canada metro.\nContinuous Improvement: Always seek ways to streamline, automate, and simplify processes; includes deployment of tools, using data analytics and working with IT groups to define system requirements.\nProcurement Planning: Implement procurement plans to effectively deliver against project goals on budget.\nNegotiation: Implement appropriate negotiation strategies for the scope.\nSupplier Selection: Participate in supplier selection and performance management; ensure alignment to Microsoft business goals throughout.\nContracting: Understand industry contracting norms and Microsoft contracting requirements; participate in negotiation of contracts that meet business goals.\nContract Oversight: Monitor key elements of supplier performance to contracted requirements; implement corrective action and lessons learned.\nProject Management: Develop and implement plans to effectively deliver goods and services on time and within specifications while managing risk.\nVendor Management: Develop and implement plans and resources to help support the build program in Canada from a supply chain perspective. This will involve the selection and on-boarding of consultant firms locally in Canada.\n\nPartners\nInternal: Engineering, construction, cost management, category management, finance, safety, legal, scheduling, end to end project management, integration, risk management and other groups as needed.\nExternal: Contractors, consultants, suppliers, and industry groups.\n\nQualifications\n\nQualifications: \nBachelor’s degree in engineering, construction or supply chain field; Masters preferred\n10+ years’ post graduate experience in supply chain/ procurement including AE, GC/trades, long lead equipment, construction services, or operations services.\n5+ years of experience in the construction market\n3+ years of experience in large scale mission critical projects (Wafer Fab, Pharma, Data Center, Healthcare, etc.)\nProficiency and experience with various procurement methodologies and sourcing techniques\nAbility to operate and execute effectively in a dynamic and fast-paced environment with multiple priorities.\nExperience in managing and leading a team (at least 2/3 direct reports)\nExcellent communication skills and ability to interact with diverse groups across various organizational levels\nAbility to implement new processes and get buy in from a cross-functional stakeholders\nProven track record in creating clarity, generating energy and delivering success; while constantly planning for the future\nHave high integrity – must be ethical and strong value-based individual focused on fairness and maintaining confidentiality\nFluent in English\n\nAdditional/Preferred Qualifications\nFluent in French\nFamiliarity with data center construction build projects\nTechnical ability to write contracts, ability to set up sourcing plans, negotiation strategies and execute against same.\nFamiliarity with common process improvement methodologies (Lean, Six-Sigma, etc.) and ability to facilitate change management.\nAble to identify and implement opportunities that reduce cost and/or cycle time.\nBring high energy – a drive to achieve results in midst of ambiguity and a matrix organization.\nBe a high performer – be able to fit the Microsoft “culture” by effectively multi-tasking and managing priorities; have a “sense of urgency” regarding issue resolution.\nUnderstand the importance of relationships inside the company and with our supply chain partners.\n\nThese requirements include, but are not limited to, the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\n\n#COICareers\n\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.\n\nBenefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.","seniority":"Director","employment_type":"Full-time","location":"Toronto, Ontario, Canada","url":"https://www.linkedin.com/jobs/view/supply-chain-execution-director-canada-at-microsoft-3388593125","hash":"962e789af7009371e75e4a8d1cc45916","company_id":5181133,"company_name":"Microsoft","company_url":"https://www.linkedin.com/company/microsoft","external_url":"https://careers.microsoft.com/us/en/job/1501163/Supply-Chain-Execution-Director-Canada?jobsource=linkedin&utm_source=linkedin&utm_medium=linkedin&utm_campaign=linkedin-feed","deleted":0,"application_active":1,"salary":null,"applicants_count":"Be among the first 25 applicants","linkedin_job_id":3388593125,"country":"Canada","last_updated_ux":1670473235,"redirected_url":"https://www.linkedin.com/jobs/view/supply-chain-execution-director-canada-at-microsoft-3388593125","redirected_url_hash":"962e789af7009371e75e4a8d1cc45916","job_functions_collection":[{"id":59988447,"job_id":104767150,"function_id":12179,"deleted":0,"created":"2022-12-08 04:20:34","last_updated":"2022-12-08 04:20:34","job_function_list":{"id":12179,"created":"2022-07-05 06:45:23","last_updated":"2022-07-05 06:45:23","function":"Management and Manufacturing","hash":"6f7f02ed0217baa605d9f42160c790e2"}}],"job_industries_collection":[{"id":79449140,"job_id":104767150,"industry_id":729,"deleted":0,"created":"2022-12-08 04:20:34","last_updated":"2022-12-08 04:20:34","job_industry_list":{"id":729,"created":"2022-07-05 09:31:42","last_updated":"2022-07-05 09:31:42","industry":"IT Services and IT Consulting, Computer Hardware Manufacturing, and Software Development","hash":"842cfe6e8fa854df1a90bc1fdcb6274e"}}],"job_status_log_collection":[{"id":1461876232,"job_id":104767150,"created":"2022-12-08 04:20:34","last_updated":"2022-12-08 04:20:35","status":"active","deleted":0}]},
  {"id":105005848,"created":"2022-12-08 21:17:45","last_updated":"2022-12-08 22:56:23","time_posted":"1 hour ago","title":"Sr. Director, Workforce of the Future","description":"Are you looking to work on something big to support Microsoft’s continued movement towards an ever more diverse and inclusive company? Does the opportunity excite you to enable the potential of Microsoft employees globally through employee-centered, quality talent and development experiences as well as function as Customer Zero, influencing Microsoft technology and products from the inside with your insights and initiatives? Microsoft Talent & Learning Experiences (TLX) is looking for a leader to join our team as the Senior Director of our Workforce of the Future! Excited? Read on!\nLead the company’s approach to Flexible Work by identifying and conducting research on delivering a differentiated, industry-leading Flexible Work program that drives industry benchmarking on both current practices and future strategies and by providing strategic, horizon 3 thought-leadership to outline our aspirations for Flexible Work, exploring new ways of working to shift paradigms, embrace flexibility, create enduring connections, promote inclusion, and drive innovation.\nLead experimentation in the Future of Work to define and evolve HR’s Future of Work vision and strategy, partnering with HR leaders from across various functions, influencing leadership on prioritization and execution of actions important to move Microsoft through the phases of the Future of Work maturity model, and initiating connections with Microsoft product/service teams to coordinate experimentation and share learnings.\nLead envisioning and company guidance around engaging talent, defining strategies for optimizing the use of all forms of talent (regular employees, project-based employees, contractors, freelancers, etc.), delivering business-specific insights and recommendations to transform talent type selection and engagement, and partnering with HR and Procurement colleagues to deliver effortless user experiences for selecting and engaging the right type of talent for a given need.\nLead the company’s global external staff risk management program, redesigning the program to shift from a broad approach to a more business/work specific approach, while developing flexible strategies to continue effectively managing risk in a dynamic global environment and partnering with corporate functions such as Procurement and Legal as well as stakeholders in each Area and country, facilitating a connected stakeholder ecosystem to ensure awareness and alignment of external staff related opportunities and initiatives.\n\nMicrosoft is on a mission to empower every person and every organization on the planet to achieve more. Our culture is centered on embracing a growth mindset, a theme of inspiring excellence, and encouraging teams and leaders to bring their best each day. In doing so, we create life-changing innovations that impact billions of lives around the world. You can help us achieve our mission.\n\nResponsibilities\n\nPeople Management \nManagers deliver success through empowerment and accountability by modeling, coaching, and caring.\nModel - Live our culture; Embody our values; Practice our leadership principles.\nCoach - Define team objectives and outcomes; Enable success across boundaries; Help the team adapt and learn.\nCare - Attract and retain great people; Know each individual’s capabilities and aspirations; Invest in the growth of others.\n\nProgram Design and Implementation\nDefines global Talent Management strategy for Flexible Work (company-wide), Talent Engagement, External Staff Risk Management, and the Future of Work in HR; translating strategy into the design of major talent programs in alignment with Center of Excellence strategy by partnering with business and HR leadership, broader Talent Management community, and other organizations; drives engagement and talent strategy through others.\nEmbeds the Microsoft cultural attributes (e.g., diversity, inclusion), leadership principles, and other talent, learning, and organizational development frameworks into talent programs/solutions for multiple organizations, lateral focus areas, or regions; holds teams accountable for applying and upholding cultural attributes, principles, and frameworks.\nManages and oversees large-scale programs and/or leverages deep business acumen to identify and implement Talent Management program needs across businesses; coordinates with leadership to achieve alignment, overcome barriers, and ensure overall program success; defines future talent management initiatives by identifying short-term and long-term business needs.\nDevelops, guides, and manages the execution of talent management programs by anticipating future organizational talent needs, identifying stakeholders and partners, and establishing priorities; holds teams accountable for project execution; analyzes business priorities and data to identify and develop talent management strategies.\n\nQualitative and Quantitative Analysis and Application\nIdentifies and addresses critical gaps in talent management tools, methodologies, and principles through identification of business needs as well as industry trends and leading practices; drives the design and/or implementation of talent management tools to improve benchmarking, evaluation, forecasting, decision-making, and management of talent.\nExchanges information with senior business leadership teams, internal HR, and external partners about business needs/insights, organizational diagnostic tools, and existing tools from the Center of Excellence, and develops integrated talent plans.\n\nChange Management\nEvaluates business drivers to make a case for change adoption; assesses risks and benefits of the changes, develops effective change-management strategies, and ensures communications and readiness materials are in place to facilitate the transition of Talent Management programs/processes.\n\nOther\nEmbody our culture and values\n\nQualifications\n\nRequired/Minimum Qualifications15+ years experience in HR practices or Program/Project Management\nOR Bachelor's Degree in Human Resources, Business, or related field AND 10+ years experience in HR practices or Program/Project Management.\n6+ years experience managing large-scale or complex projects/programs.\n\nAdditional Or Preferred Qualifications\nMaster's Degree in Human Resources, Business, Organization Development, Psychology, or related field.\n5+ years People Management experience, either direct or indirect through team leadership.\n\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.\n\nBenefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.","seniority":"Director","employment_type":"Full-time","location":"Iowa, United States","url":"https://www.linkedin.com/jobs/view/sr-director-workforce-of-the-future-at-microsoft-3389748437","hash":"c9dc7e183306f82a5919011b5cb4c287","company_id":5181133,"company_name":"Microsoft","company_url":"https://www.linkedin.com/company/microsoft","external_url":null,"deleted":0,"application_active":1,"salary":null,"applicants_count":"Be among the first 25 applicants","linkedin_job_id":3389748437,"country":"United States","last_updated_ux":1670540183,"redirected_url":"https://www.linkedin.com/jobs/view/sr-director-workforce-of-the-future-at-microsoft-3389748437","redirected_url_hash":"c9dc7e183306f82a5919011b5cb4c287","job_functions_collection":[{"id":60202124,"job_id":105005848,"function_id":32,"deleted":0,"created":"2022-12-08 21:17:45","last_updated":"2022-12-08 21:17:45","job_function_list":{"id":32,"created":"2020-08-14 14:11:48","last_updated":"2020-08-14 14:11:48","function":"Human Resources","hash":"d19092ef5301d9548911f87a817f8c44"}}],"job_industries_collection":[{"id":79703946,"job_id":105005848,"industry_id":729,"deleted":0,"created":"2022-12-08 21:17:45","last_updated":"2022-12-08 21:17:45","job_industry_list":{"id":729,"created":"2022-07-05 09:31:42","last_updated":"2022-07-05 09:31:42","industry":"IT Services and IT Consulting, Computer Hardware Manufacturing, and Software Development","hash":"842cfe6e8fa854df1a90bc1fdcb6274e"}}],"job_status_log_collection":[{"id":1465274164,"job_id":105005848,"created":"2022-12-08 21:17:45","last_updated":"2022-12-08 21:47:29","status":"active","deleted":1},{"id":1465385069,"job_id":105005848,"created":"2022-12-08 21:47:29","last_updated":"2022-12-08 21:55:09","status":"active","deleted":1},{"id":1465409927,"job_id":105005848,"created":"2022-12-08 21:55:09","last_updated":"2022-12-08 22:19:13","status":"active","deleted":1},{"id":1465480671,"job_id":105005848,"created":"2022-12-08 22:19:13","last_updated":"2022-12-08 22:38:40","status":"active","deleted":1},{"id":1465532369,"job_id":105005848,"created":"2022-12-08 22:38:40","last_updated":"2022-12-08 22:49:40","status":"active","deleted":1},{"id":1465561081,"job_id":105005848,"created":"2022-12-08 22:49:40","last_updated":"2022-12-08 22:56:23","status":"active","deleted":1},{"id":1465575751,"job_id":105005848,"created":"2022-12-08 22:56:22","last_updated":"2022-12-08 22:56:23","status":"active","deleted":0}]},
  {"id":105011711,"created":"2022-12-08 21:38:53","last_updated":"2022-12-08 22:38:34","time_posted":"1 hour ago","title":"Director, Engineering, Microsoft Production Studios","description":"Are you energized by the prospect of working in a fast paced, high impact environment providing the technology, innovation, and direction that is the backbone of digital experiences for Microsoft’s largest global productions and events?\n\nWe are looking for a strategic and self-motivated individual to implement consistent and effective cutting-edge IT based broadcast solutions. The position requires strong team management and leadership skills and a wide range of technical knowledge necessary to design, maintain, and install broadcast and IT equipment in both studio and outside facilities.\n\nThe role requires someone who is resourceful and innovative and prides themselves on the quality and effectiveness of their work. This person provides thought leadership that cuts through ambiguity. You will be part of a larger team of media professionals developing and delivering engaging in-person and digital event experiences.\n\nResponsibilities\nIn-house leadership and production support of live and recorded programming requires a thorough systems knowledge of broadcast IT infrastructure which includes:\nTechnical spaces (control rooms, studios, terminal gear/equipment/central apparatus/distribution riser rooms and data centers) and\nAssociated production systems (A/V routing, signal processing, cameras, switchers, audio mixers, intercom, encoders/encoding, feeds/edit systems, master control, automation and transmission systems.  Knowledge of Cloud Computing & Virtual Private Cloud is a plus.)\nA strong IT and data networking knowledge is also necessary to work in an facility transitioning to IP and IT centric broadcast/multimedia infrastructure.\nCollaboration with team members, Clients, Partners, and other support groups is required to troubleshoot and resolve issues with broadcast/multimedia systems and computers in our production environments.\nThis position will primarily provide facility-based support.  However, there may be occasions requiring travel to support of outside productions/events or to provide technical support to upgrade outside broadcast facilities.\nA willingness to adapt to changing priorities, and the ability to solve complex technical problems independently and with team members is essential to be successful in this position.  Excellent communication skills (verbal, written) are required.\n\nQualifications\n\nRequired/Minimum Qualifications7+ years experience in program management, digital content publishing and management, or experience in a writing or editing role\n\nOR equivalent experience.\n2+ years people management experience.\n\nPreferred Qualificiations\n4 or more years of experience in television, multimedia content, IT client service or broadcast maintenance capacity, with a demonstrated ability to troubleshoot broadcast and computer equipment.\n2+ years of management experience, leading team members in the Broadcast and IT discipline.\nA thorough understanding of SMPTE 2110\nLead a team of Supplies and Integrators to complete build out of SMPTE 2110.\nExpertise in managing a direct team of 3 plus expanded vendor/supplier team of 25+\nDemonstrated experience with television, broadcast or multimedia production workflows.\nDemonstrated familiarity with basic server, networking topology and operating systems (e.g., Windows, Unix, etc.)\nMust be willing to be on call for coverage of critical technical systems.\nWillingness to research and understand proprietary equipment and applications.\nUnderstanding of LED Digital Wall systems and related media processing systems\nManufacturer-provided broadcast training from companies such as Sony, Riedel, Lawo, Evertz, etc\nMicrosoft network certification/MS Office Suite\nVisio experience.\nFamiliarity with ITSM Service Management processes.\nDemonstrated knowledge of computer desktop hardware/applications\nDeep understanding of infrastructure systems including routers, intercom, monitoring, KVM, audio suites and other live production related gear.\n\n#ESC\n\nContent Program Management M5 - The typical base pay range for this role across the U.S. is USD $133,600 - $256,800 per year. Microsoft has different base pay ranges for different work locations within the United States, which allows us to pay employees competitively and consistently in different geographic markets (see below). The range above reflects the potential base pay across the U.S. for this role (except as noted below); the applicable base pay range will depend on what ultimately is determined to be the candidate’s primary work location. Individual base pay depends on various factors, in addition to primary work location, such as complexity and responsibility of role, job duties/requirements, and relevant experience and skills. Base pay ranges are reviewed and typically updated each year. Offers are made within the base pay range applicable at the time. At Microsoft certain roles are eligible for additional rewards, including merit increases, annual bonus and stock. These awards are allocated based on individual performance. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee’s role. Benefits/perks listed here may vary depending on the nature of employment with Microsoft and the country work location. U.S.-based employees have access to healthcare benefits, a 401(k) plan and company match, short-term and long-term disability coverage, basic life insurance, wellbeing benefits, paid vacation time, paid sick and mental health time, and several paid holidays, among others.\n\nThere is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $173,200 - $282,200 per year. Our commitment to pay equity We are committed to the principle of pay equity – paying employees equitably for substantially similar work.\n\nTo learn more about pay equity and our other commitments to increase representation and strengthen our culture of inclusion, check out our annual Diversity & Inclusion Report. (https://www.microsoft.com/en-us/diversity/inside-Microsoft/annual-report ) Understanding roles at Microsoft The top of this page displays the role for which the base pay ranges apply – Content Program Management M5. The way we define roles includes two things: discipline (the type of work) and career stage (scope and complexity). The career stage has two parts – the first identifies whether the role is a manager (M), an individual contributor (IC), an admin-technician-retail (ATR) job, or an intern. The second part identifies the relative seniority of the role – a higher number (or later letter alphabetically in the case of ATR) indicates greater scope and complexity.\n\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.\n\nBenefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.","seniority":"Director","employment_type":"Full-time","location":"Redmond, WA","url":"https://www.linkedin.com/jobs/view/director-engineering-microsoft-production-studios-at-microsoft-3389750379","hash":"18c7c0796bf55334bf03d970aa2b9105","company_id":5181133,"company_name":"Microsoft","company_url":"https://www.linkedin.com/company/microsoft","external_url":null,"deleted":0,"application_active":1,"salary":null,"applicants_count":"Be among the first 25 applicants","linkedin_job_id":3389750379,"country":"United States","last_updated_ux":1670539114,"redirected_url":"https://www.linkedin.com/jobs/view/director-engineering-microsoft-production-studios-at-microsoft-3389750379","redirected_url_hash":"18c7c0796bf55334bf03d970aa2b9105","job_functions_collection":[{"id":60207547,"job_id":105011711,"function_id":12174,"deleted":0,"created":"2022-12-08 21:38:53","last_updated":"2022-12-08 21:38:53","job_function_list":{"id":12174,"created":"2022-07-05 06:45:20","last_updated":"2022-07-05 06:45:20","function":"Engineering and Information Technology","hash":"c7d4b4730b5f9d1b68036c6bf6f7eb70"}}],"job_industries_collection":[{"id":79710803,"job_id":105011711,"industry_id":729,"deleted":0,"created":"2022-12-08 21:38:53","last_updated":"2022-12-08 21:38:53","job_industry_list":{"id":729,"created":"2022-07-05 09:31:42","last_updated":"2022-07-05 09:31:42","industry":"IT Services and IT Consulting, Computer Hardware Manufacturing, and Software Development","hash":"842cfe6e8fa854df1a90bc1fdcb6274e"}}],"job_status_log_collection":[{"id":1465355871,"job_id":105011711,"created":"2022-12-08 21:38:53","last_updated":"2022-12-08 22:12:42","status":"active","deleted":1},{"id":1465463966,"job_id":105011711,"created":"2022-12-08 22:12:42","last_updated":"2022-12-08 22:38:34","status":"active","deleted":1},{"id":1465532009,"job_id":105011711,"created":"2022-12-08 22:38:34","last_updated":"2022-12-08 22:38:34","status":"active","deleted":0}]},
  {"id":105297428,"created":"2022-12-09 18:05:47","last_updated":"2022-12-09 18:05:47","time_posted":"9 minutes ago","title":"Country and Regional Director, Switzerland (German, English)","description":"Minimum qualifications:\n\nExperience in commercial general management within the technology, advertising, or online industries.\nExperience with the Swiss market and working as a Country Manager, Regional Leader, or General Manager of a growing business.\nAbility to speak and write in German and English fluently.\n\n\nPreferred qualifications:\n\nExperience working in a multi-national organization.\nExperience managing cross-functionally with integrity.\nAbility to focus and prioritize in a growing business environment.\nAbility to influence media, business, and government channels with relationships within the advertising, technology, and startup sectors.\nAbility to create an inclusive environment and lead a high performance sales team.\n\n\nAbout The Job\n\nThis role offers the opportunity to lead Google’s business in Switzerland and Alpine region and to help users make the most of the web. Reporting to the Vice President, Google Central Europe, you will be a member of the Europe, Middle East, and Africa Leadership team and will be expected to contribute to the strategy and business development of the region.\n\nIn this role as the Country Director, you will lead a cross-functional team and represent aspects of Google in Switzerland. You are the official contact for Google Switzerland and you will be responsible for how businesses, government, and consumers view Google.\n\nOur Large Customer Sales teams partner closely with many of the world’s biggest advertisers and agencies to develop digital solutions that build businesses and brands. We enjoy a bird’s eye view on the massive transformation occurring as advertising shifts to mobile and online platforms. We're uniquely situated to help shape how companies grow their businesses in the digital age. We advise clients on Google's broad range of products across search, video and mobile to help them connect instantly and seamlessly with their audiences.\n\nResponsibilities\n\nLead sales and commercial operations to deliver business growth, and build key external relationships to open up business opportunities.\nRepresent Google in the market beyond business relationships (e.g., government, media, etc.), and represent Switzerland and Alpine to Google through product and policies around business challenges and opportunities.\nCollaborate cross-functionally bringing teams together around an integrated plan for Google’s progression in the market.\n\n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .","seniority":"Director","employment_type":"Full-time","location":"Zurich, Zurich, Switzerland","url":"https://www.linkedin.com/jobs/view/country-and-regional-director-switzerland-german-english-at-google-3390569054","hash":"3c1a78acd59d1e3ad26ca59c554af73e","company_id":3252082,"company_name":"Google","company_url":"https://www.linkedin.com/company/google","external_url":null,"deleted":0,"application_active":1,"salary":null,"applicants_count":"Be among the first 25 applicants","linkedin_job_id":3390569054,"country":"Switzerland","last_updated_ux":1670609147,"redirected_url":"https://www.linkedin.com/jobs/view/country-and-regional-director-switzerland-german-english-at-google-3390569054","redirected_url_hash":"3c1a78acd59d1e3ad26ca59c554af73e","job_functions_collection":[{"id":60472556,"job_id":105297428,"function_id":15535,"deleted":0,"created":"2022-12-09 18:05:47","last_updated":"2022-12-09 18:05:47","job_function_list":{"id":15535,"created":"2022-07-05 09:34:14","last_updated":"2022-07-05 09:34:14","function":"Sales, Advertising, and Customer Service","hash":"59d0ec78b838c4e587f1aba903d97612"}}],"job_industries_collection":[{"id":80295374,"job_id":105297428,"industry_id":752,"deleted":0,"created":"2022-12-09 18:05:47","last_updated":"2022-12-09 18:05:47","job_industry_list":{"id":752,"created":"2022-07-05 09:31:46","last_updated":"2022-07-05 09:31:46","industry":"Information Services and Technology, Information and Internet","hash":"ccec78135ad925f08c170fd2a087eef6"}}],"job_status_log_collection":[{"id":1468735252,"job_id":105297428,"created":"2022-12-09 18:05:47","last_updated":"2022-12-09 18:05:47","status":"active","deleted":0}]},
  {"id":105488745,"created":"2022-12-10 11:31:52","last_updated":"2022-12-10 11:31:52","time_posted":"36 minutes ago","title":"Latin America Credit Research - Vice President","description":"As a Vice President in Credit Research, you will conduct and facilitate industry analysis and company-specific coverage. This involves core research ranging from dissecting earnings releases and regulatory filings to assessing relevant news events, modelling financial statements and industry dynamics, performing detailed valuation work, writing research notes and sector pieces, and speaking to internal/external clients and management teams about the securities/sector. You will work with our partners in both sales and trading to provide comprehensive client coverage, including fulfilling client requests for market updates and market intelligence. Research is fast-paced, demanding and intellectually stimulating. We look for candidates who possess strong accounting, finance, quantitative and business writing/communication skills, as well as modelling, forecasting, and valuation experience.\n\nThis role requires a wide variety of strengths and capabilities, including:\n\nMinimum 5yrs experience in research, investment banking or another analytical and demanding role\nAdvanced level of proficiency in Excel\nStrong written and oral communication skills\nA passion for the markets and interest in industry specific coverage\nPortuguese and Spanish are desirable language skills, but not mandatory\nCFA is a plus\n\n\nJ.P. Morgan is a global leader in financial services, providing strategic advice and products to the world's most prominent corporations, governments, wealthy individuals and institutional investors. Our first-class business in a first-class way approach to serving clients drives everything we do. We strive to build trusted, long-term partnerships to help our clients achieve their business objectives.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants' and employees' religious practices and beliefs, as well as any mental health or physical disability needs.","seniority":"Director","employment_type":"Full-time","location":"São Paulo, São Paulo, Brazil","url":"https://www.linkedin.com/jobs/view/latin-america-credit-research-vice-president-at-jpmorgan-chase-co-3384481268","hash":"6f7fcdbb456e69084e22e0a0c3e72975","company_id":8172788,"company_name":"JPMorgan Chase & Co.","company_url":"https://www.linkedin.com/company/jpmorganchase","external_url":null,"deleted":0,"application_active":1,"salary":null,"applicants_count":"Be among the first 25 applicants","linkedin_job_id":3384481268,"country":"Brazil","last_updated_ux":1670671912,"redirected_url":"https://www.linkedin.com/jobs/view/latin-america-credit-research-vice-president-at-jpmorgan-chase-co-3384481268","redirected_url_hash":"6f7fcdbb456e69084e22e0a0c3e72975","job_functions_collection":[{"id":60653725,"job_id":105488745,"function_id":12184,"deleted":0,"created":"2022-12-10 11:31:52","last_updated":"2022-12-10 11:31:52","job_function_list":{"id":12184,"created":"2022-07-05 06:45:32","last_updated":"2022-07-05 06:45:32","function":"Finance and Sales","hash":"19f7f8bbfd0040c86170f405cf39f8f7"}}],"job_industries_collection":[{"id":80498032,"job_id":105488745,"industry_id":1,"deleted":0,"created":"2022-12-10 11:31:52","last_updated":"2022-12-10 11:31:52","job_industry_list":{"id":1,"created":"2020-08-14 14:11:37","last_updated":"2020-08-14 14:11:37","industry":"Financial Services","hash":"f279b250fb9ccc9ae5a43849e8f6fd4c"}}],"job_status_log_collection":[{"id":1469857328,"job_id":105488745,"created":"2022-12-10 11:31:52","last_updated":"2022-12-10 11:31:52","status":"active","deleted":0}]}
]
